MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/**
  * @brief Ethernet Peripheral
  */
typedef struct
{
  __IOM uint32_t MACCR;                              /*!< Operating mode configuration register,                   Address offset: 0x000 */
  __IOM uint32_t MACECR;                             /*!< Extended operating mode configuration register,          Address offset: 0x004 */
  __IOM uint32_t MACPFR;                             /*!< Packet filtering control register,                       Address offset: 0x008 */
  __IOM uint32_t MACWJBTR;                           /*!< Watchdog and jabber timeout register,                    Address offset: 0x00C */
  __IOM uint32_t MACHT0R;                            /*!< Hash Table 0 register,                                   Address offset: 0x010 */
  __IOM uint32_t MACHT1R;                            /*!< Hash Table 1 register,                                   Address offset: 0x014 */
        uint32_t RESERVED1[14];                      /*!< Reserved,                                                Address offset: 0x018 */
  __IOM uint32_t MACVTR;                             /*!< VLAN tag register,                                       Address offset: 0x050 */
        uint32_t RESERVED2;                          /*!< Reserved,                                                Address offset: 0x054 */
  __IOM uint32_t MACVHTR;                            /*!< VLAN Hash table register,                                Address offset: 0x058 */
        uint32_t RESERVED3;                          /*!< Reserved,                                                Address offset: 0x05C */
  __IOM uint32_t MACVIR;                             /*!< VLAN inclusion register,                                 Address offset: 0x060 */
  __IOM uint32_t MACIVIR;                            /*!< Inner VLAN inclusion register,                           Address offset: 0x064 */
        uint32_t RESERVED4[2];                       /*!< Reserved,                                                Address offset: 0x068 */
  __IOM uint32_t MACQTXFCR;                          /*!< Tx Queue flow control register,                          Address offset: 0x070 */
        uint32_t RESERVED5[7];                       /*!< Reserved,                                                Address offset: 0x074 */
  __IOM uint32_t MACRXFCR;                           /*!< Rx flow control register,                                Address offset: 0x090 */
        uint32_t RESERVED6[7];                       /*!< Reserved,                                                Address offset: 0x094 */
  __IOM uint32_t MACISR;                             /*!< Interrupt status register,                               Address offset: 0x0B0 */
  __IOM uint32_t MACIER;                             /*!< Interrupt enable register,                               Address offset: 0x0B4 */
  __IOM uint32_t MACRXTXSR;                          /*!< Rx Tx status register,                                   Address offset: 0x0B8 */
        uint32_t RESERVED7;                          /*!< Reserved,                                                Address offset: 0x0BC */
  __IOM uint32_t MACPCSR;                            /*!< PMT control status register,                             Address offset: 0x0C0 */
  __IOM uint32_t MACRWKPFR;                          /*!< Remote wake-up packet filter register,                   Address offset: 0x0C4 */
        uint32_t RESERVED8[2];                       /*!< Reserved,                                                Address offset: 0x0C8 */
  __IOM uint32_t MACLCSR;                            /*!< LPI control and status register,                         Address offset: 0x0D0 */
  __IOM uint32_t MACLTCR;                            /*!< LPI timers control register,                             Address offset: 0x0D4 */
  __IOM uint32_t MACLETR;                            /*!< LPI entry timer register,                                Address offset: 0x0D8 */
  __IOM uint32_t MAC1USTCR;                          /*!< One-microsecond-tick counter register,                   Address offset: 0x0DC */
        uint32_t RESERVED9[12];                      /*!< Reserved,                                                Address offset: 0x0E0 */
  __IM  uint32_t MACVR;                              /*!< Version register,                                        Address offset: 0x110 */
  __IM  uint32_t MACDR;                              /*!< Debug register,                                          Address offset: 0x114 */
        uint32_t RESERVED10;                         /*!< Reserved,                                                Address offset: 0x118 */
  __IM  uint32_t MACHWF0R;                           /*!< HW feature 0 register,                                   Address offset: 0x11C */
  __IM  uint32_t MACHWF1R;                           /*!< HW feature 1 register,                                   Address offset: 0x120 */
  __IM  uint32_t MACHWF2R;                           /*!< HW feature 2 register,                                   Address offset: 0x124 */
  __IM  uint32_t MACHWF3R;                           /*!< HW feature 3 register,                                   Address offset: 0x128 */
        uint32_t RESERVED11[53];                     /*!< Reserved,                                                Address offset: 0x12C */
  __IOM uint32_t MACMDIOAR;                          /*!< MDIO address register,                                   Address offset: 0x200 */
  __IOM uint32_t MACMDIODR;                          /*!< MDIO data register,                                      Address offset: 0x204 */
        uint32_t RESERVED12[2];                      /*!< Reserved,                                                Address offset: 0x208 */
  __IOM uint32_t MACARPAR;                           /*!< ARP address register,                                    Address offset: 0x210 */
        uint32_t RESERVED13[7];                      /*!< Reserved,                                                Address offset: 0x214 */
  __IOM uint32_t MACCSRSWCR;                         /*!< CSR software control register,                           Address offset: 0x230 */
        uint32_t RESERVED14[3];                      /*!< Reserved,                                                Address offset: 0x234 */
  __IOM uint32_t MACPRSTIMR;                         /*!< MAC presentation time register,                          Address offset: 0x240 */
  __IOM uint32_t MACPRSTIMUR;                        /*!< MAC presentation time update register,                   Address offset: 0x244 */
        uint32_t RESERVED15[46];                     /*!< Reserved,                                                Address offset: 0x248 */
  __IOM uint32_t MACA0HR;                            /*!< MAC Address 0 high register,                             Address offset: 0x300 */
  __IOM uint32_t MACA0LR;                            /*!< MAC Address 0 low register,                              Address offset: 0x304 */
  __IOM uint32_t MACA1HR;                            /*!< MAC Address 1 high register,                             Address offset: 0x308 */
  __IOM uint32_t MACA1LR;                            /*!< MAC Address 1 low register,                              Address offset: 0x30C */
  __IOM uint32_t MACA2HR;                            /*!< MAC Address 2 high register,                             Address offset: 0x310 */
  __IOM uint32_t MACA2LR;                            /*!< MAC Address 2 low register,                              Address offset: 0x314 */
  __IOM uint32_t MACA3HR;                            /*!< MAC Address 3 high register,                             Address offset: 0x318 */
  __IOM uint32_t MACA3LR;                            /*!< MAC Address 3 low register,                              Address offset: 0x31C */
        uint32_t RESERVED16[248];                    /*!< Reserved,                                                Address offset: 0x320 */
  __IOM uint32_t MMC_CONTROL;                        /*!< MMC control register,                                    Address offset: 0x700 */
  __IOM uint32_t MMC_RX_INTERRUPT;                   /*!< MMC Rx interrupt register,                               Address offset: 0x704 */
  __IOM uint32_t MMC_TX_INTERRUPT;                   /*!< MMC Tx interrupt register,                               Address offset: 0x708 */
  __IOM uint32_t MMC_RX_INTERRUPT_MASK;              /*!< MMC Rx interrupt mask register,                          Address offset: 0x70C */
  __IOM uint32_t MMC_TX_INTERRUPT_MASK;              /*!< MMC Tx interrupt mask register,                          Address offset: 0x710 */
        uint32_t RESERVED17[14];                     /*!< Reserved,                                                Address offset: 0x714 */
  __IM  uint32_t TX_SINGLE_COLLISION_GOOD_PACKETS;   /*!< Tx single collision good packets register,               Address offset: 0x74C */
  __IM  uint32_t TX_MULTIPLE_COLLISION_GOOD_PACKETS; /*!< Tx multiple collision good packets register,             Address offset: 0x750 */
        uint32_t RESERVED18[5];                      /*!< Reserved,                                                Address offset: 0x754 */
  __IM  uint32_t TX_PACKET_COUNT_GOOD;               /*!< Tx packet count good register,                           Address offset: 0x768 */
        uint32_t RESERVED19[10];                     /*!< Reserved,                                                Address offset: 0x76C */
  __IM  uint32_t RX_CRC_ERROR_PACKETS;               /*!< Rx CRC error packets register,                           Address offset: 0x794 */
  __IM  uint32_t RX_ALIGNMENT_ERROR_PACKETS;         /*!< Rx alignment error packets register,                     Address offset: 0x798 */
        uint32_t RESERVED20[10];                     /*!< Reserved,                                                Address offset: 0x79C */
  __IM  uint32_t RX_UNICAST_PACKETS_GOOD;            /*!< Rx unicast packets good register,                        Address offset: 0x7C4 */
        uint32_t RESERVED21[9];                      /*!< Reserved,                                                Address offset: 0x7C8 */
  __IM  uint32_t TX_LPI_USEC_CNTR;                   /*!< Tx LPI microsecond timer register,                       Address offset: 0x7EC */
  __IM  uint32_t TX_LPI_TRAN_CNTR;                   /*!< Tx LPI transition counter register,                      Address offset: 0x7F0 */
  __IM  uint32_t RX_LPI_USEC_CNTR;                   /*!< Rx LPI microsecond counter register,                     Address offset: 0x7F4 */
  __IM  uint32_t RX_LPI_TRAN_CNTR;                   /*!< Rx LPI transition counter register,                      Address offset: 0x7F8 */
        uint32_t RESERVED22[65];                     /*!< Reserved,                                                Address offset: 0x7FC */
  __IOM uint32_t MACL3L4C0R;                         /*!< L3 and L4 control 0 register,                            Address offset: 0x900 */
  __IOM uint32_t MACL4A0R;                           /*!< Layer4 Address filter 0 register,                        Address offset: 0x904 */
        uint32_t RESERVED23[2];                      /*!< Reserved,                                                Address offset: 0x908 */
  __IOM uint32_t MACL3A00R;                          /*!< Layer3 Address 0 filter 0 register,                      Address offset: 0x910 */
  __IOM uint32_t MACL3A10R;                          /*!< Layer3 Address 1 filter 0 register,                      Address offset: 0x914 */
  __IOM uint32_t MACL3A20R;                          /*!< Layer3 Address 2 filter 0 register,                      Address offset: 0x918 */
  __IOM uint32_t MACL3A30R;                          /*!< Layer3 Address 3 filter 0 register,                      Address offset: 0x91C */
        uint32_t RESERVED24[4];                      /*!< Reserved,                                                Address offset: 0x920 */
  __IOM uint32_t MACL3L4C1R;                         /*!< L3 and L4 control 1 register,                            Address offset: 0x930 */
  __IOM uint32_t MACL4A1R;                           /*!< Layer 4 address filter 1 register,                       Address offset: 0x934 */
        uint32_t RESERVED25[2];                      /*!< Reserved,                                                Address offset: 0x938 */
  __IOM uint32_t MACL3A01R;                          /*!< Layer3 address 0 filter 1 Register,                      Address offset: 0x940 */
  __IOM uint32_t MACL3A11R;                          /*!< Layer3 address 1 filter 1 register,                      Address offset: 0x944 */
  __IOM uint32_t MACL3A21R;                          /*!< Layer3 address 2 filter 1 Register,                      Address offset: 0x948 */
  __IOM uint32_t MACL3A31R;                          /*!< Layer3 address 3 filter 1 register,                      Address offset: 0x94C */
        uint32_t RESERVED26[72];                     /*!< Reserved,                                                Address offset: 0x950 */
  __IOM uint32_t MAC_IACR;                           /*!< MAC Indirect Access Control register,                    Address offset: 0xA70 */
  __IOM uint32_t MAC_TMRQR;                          /*!< MAC type-based Rx Queue mapping register,                Address offset: 0xA74 */
        uint32_t RESERVED27[34];                     /*!< Reserved,                                                Address offset: 0xA78 */
  __IOM uint32_t MACTSCR;                            /*!< Timestamp control Register,                              Address offset: 0xB00 */
  __IOM uint32_t MACSSIR;                            /*!< Subsecond increment register,                            Address offset: 0xB04 */
  __IM  uint32_t MACSTSR;                            /*!< System time seconds register,                            Address offset: 0xB08 */
  __IM  uint32_t MACSTNR;                            /*!< System time nanoseconds register,                        Address offset: 0xB0C */
  __IOM uint32_t MACSTSUR;                           /*!< System time seconds update register,                     Address offset: 0xB10 */
  __IOM uint32_t MACSTNUR;                           /*!< System time nanoseconds update register,                 Address offset: 0xB14 */
  __IOM uint32_t MACTSAR;                            /*!< Timestamp addend register,                               Address offset: 0xB18 */
        uint32_t RESERVED28;                         /*!< Reserved,                                                Address offset: 0xB1C */
  __IOM uint32_t MACTSSR;                            /*!< Timestamp status register,                               Address offset: 0xB20 */
  __IOM uint32_t MACRXDTI;                           /*!< Rx domain time increment register,                       Address offset: 0xB24 */
  __IOM uint32_t MACTXDTI;                           /*!< Tx domain time increment register,                       Address offset: 0xB28 */
        uint32_t RESERVED29;                         /*!< Reserved,                                                Address offset: 0xB2C */
  __IOM uint32_t MACTXTSSNR;                         /*!< Tx timestamp status nanoseconds register,                Address offset: 0xB30 */
  __IM  uint32_t MACTXTSSSR;                         /*!< Tx timestamp status seconds register,                    Address offset: 0xB34 */
        uint32_t RESERVED30[2];                      /*!< Reserved,                                                Address offset: 0xB38 */
  __IOM uint32_t MACACR;                             /*!< Auxiliary control register,                              Address offset: 0xB40 */
        uint32_t RESERVED31;                         /*!< Reserved,                                                Address offset: 0xB44 */
  __IM  uint32_t MACATSNR;                           /*!< Auxiliary timestamp nanoseconds register,                Address offset: 0xB48 */
  __IM  uint32_t MACATSSR;                           /*!< Auxiliary timestamp seconds register,                    Address offset: 0xB4C */
  __IOM uint32_t MACTSIACR;                          /*!< Timestamp ingress asymmetric correction register,        Address offset: 0xB50 */
  __IOM uint32_t MACTSEACR;                          /*!< Timestamp egress asymmetric correction register,         Address offset: 0xB54 */
  __IOM uint32_t MACTSICNR;                          /*!< Timestamp Ingress correction nanosecond register,        Address offset: 0xB58 */
  __IOM uint32_t MACTSECNR;                          /*!< Timestamp egress correction nanosecond register,         Address offset: 0xB5C */
        uint32_t RESERVED32[2];                      /*!< Reserved,                                                Address offset: 0xB60 */
  __IM  uint32_t MACTSILR;                           /*!< Timestamp Ingress Latency register,                      Address offset: 0xB68 */
  __IM  uint32_t MACTSELR;                           /*!< Timestamp Egress Latency register,                       Address offset: 0xB6C */
  __IOM uint32_t MACPPSCR;                           /*!< PPS control register,                                    Address offset: 0xB70 */
        uint32_t RESERVED33[3];                      /*!< Reserved,                                                Address offset: 0xB74 */
  __IOM uint32_t MACPPSTTSR;                         /*!< PPS target time seconds register,                        Address offset: 0xB80 */
  __IOM uint32_t MACPPSTTNR;                         /*!< PPS target time nanoseconds register,                    Address offset: 0xB84 */
  __IOM uint32_t MACPPSIR;                           /*!< PPS interval register,                                   Address offset: 0xB88 */
  __IOM uint32_t MACPPSWR;                           /*!< PPS width register,                                      Address offset: 0xB8C */
        uint32_t RESERVED34[12];                     /*!< Reserved,                                                Address offset: 0xB90 */
  __IOM uint32_t MACPOCR;                            /*!< PTP Offload control register,                            Address offset: 0xBC0 */
  __IOM uint32_t MACSPI0R;                           /*!< PTP Source Port Identity 0 Register,                     Address offset: 0xBC4 */
  __IOM uint32_t MACSPI1R;                           /*!< PTP Source port identity 1 register,                     Address offset: 0xBC8 */
  __IOM uint32_t MACSPI2R;                           /*!< PTP Source port identity 2 register,                     Address offset: 0xBCC */
  __IOM uint32_t MACLMIR;                            /*!< Log message interval register,                           Address offset: 0xBD0 */
        uint32_t RESERVED35[11];                     /*!< Reserved,                                                Address offset: 0xBD4 */
  __IOM uint32_t MTLOMR;                             /*!< Operating mode register,                                 Address offset: 0xC00 */
        uint32_t RESERVED36[7];                      /*!< Reserved,                                                Address offset: 0xC04 */
  __IM  uint32_t MTLISR;                             /*!< Interrupt status register,                               Address offset: 0xC20 */
        uint32_t RESERVED37[55];                     /*!< Reserved,                                                Address offset: 0xC24 */
  __IOM uint32_t MTLTXQOMR;                          /*!< Tx queue operating mode register,                        Address offset: 0xD00 */
  __IOM uint32_t MTLTXQUR;                           /*!< Tx queue underflow register,                             Address offset: 0xD04 */
  __IM  uint32_t MTLTXQDR;                           /*!< Tx queue debug register,                                 Address offset: 0xD08 */
        uint32_t RESERVED38[8];                      /*!< Reserved,                                                Address offset: 0xD0C */
  __IOM uint32_t MTLQICSR;                           /*!< Queue interrupt control status register,                 Address offset: 0xD2C */
  __IOM uint32_t MTLRXQOMR;                          /*!< Rx queue operating mode register,                        Address offset: 0xD30 */
  __IOM uint32_t MTLRXQMPOCR;                        /*!< Rx queue missed packet and overflow counter register,    Address offset: 0xD34 */
  __IM  uint32_t MTLRXQDR;                           /*!< Rx queue debug register,                                 Address offset: 0xD38 */
        uint32_t RESERVED39[177];                    /*!< Reserved,                                                Address offset: 0xD3C */
  __IOM uint32_t DMAMR;                              /*!< DMA mode register,                                       Address offset: 0x1000 */
  __IOM uint32_t DMASBMR;                            /*!< System bus mode register,                                Address offset: 0x1004 */
  __IM  uint32_t DMAISR;                             /*!< Interrupt status register,                               Address offset: 0x1008 */
  __IM  uint32_t DMADSR;                             /*!< Debug status register,                                   Address offset: 0x100C */
        uint32_t RESERVED40[60];                     /*!< Reserved,                                                Address offset: 0x1010 */
  __IOM uint32_t DMACCR;                             /*!< Channel control register,                                Address offset: 0x1100 */
  __IOM uint32_t DMACTXCR;                           /*!< Channel transmit control register,                       Address offset: 0x1104 */
  __IOM uint32_t DMACRXCR;                           /*!< Channel  receive control register,                       Address offset: 0x1108 */
        uint32_t RESERVED41[2];                      /*!< Reserved,                                                Address offset: 0x110C */
  __IOM uint32_t DMACTXDLAR;                         /*!< Channel Tx descriptor list address register,             Address offset: 0x1114 */
        uint32_t RESERVED42;                         /*!< Reserved,                                                Address offset: 0x1118 */
  __IOM uint32_t DMACRXDLAR;                         /*!< Channel Rx descriptor list address register,             Address offset: 0x111C */
  __IOM uint32_t DMACTXDTPR;                         /*!< Channel Tx descriptor tail pointer register,             Address offset: 0x1120 */
        uint32_t RESERVED43;                         /*!< Reserved,                                                Address offset: 0x1124 */
  __IOM uint32_t DMACRXDTPR;                         /*!< Channel  Rx descriptor tail pointer register,            Address offset: 0x1128 */
  __IOM uint32_t DMACTXRLR;                          /*!< Channel Tx descriptor ring length register,              Address offset: 0x112C */
  __IOM uint32_t DMACRXRLR;                          /*!< Channel  Rx descriptor ring length register,             Address offset: 0x1130 */
  __IOM uint32_t DMACIER;                            /*!< Channel interrupt enable register,                       Address offset: 0x1134 */
  __IOM uint32_t DMACRXIWTR;                         /*!< Channel  Rx interrupt watchdog timer register,           Address offset: 0x1138 */
        uint32_t RESERVED44[2];                      /*!< Reserved,                                                Address offset: 0x113C */
  __IM  uint32_t DMACCATXDR;                         /*!< Channel current application transmit descriptor register,Address offset: 0x1144 */
