MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/**
  * @brief Instruction cache (ICACHE)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< ICACHE control register,                                 Address offset: 0x000 */
  __IM  uint32_t SR;              /*!< ICACHE status register,                                  Address offset: 0x004 */
  __IOM uint32_t IER;             /*!< ICACHE interrupt enable register,                        Address offset: 0x008 */
  __OM  uint32_t FCR;             /*!< ICACHE flag clear register,                              Address offset: 0x00C */
  __IM  uint32_t HMONR;           /*!< ICACHE hit monitor register,                             Address offset: 0x010 */
  __IM  uint32_t MMONR;           /*!< ICACHE miss monitor register,                            Address offset: 0x014 */
        uint32_t RESERVED1[2];    /*!< Reserved,                                                Address offset: 0x018 */
  __IOM uint32_t CRR0;            /*!< ICACHE region 0 configuration register,                  Address offset: 0x020 */
  __IOM uint32_t CRR1;            /*!< ICACHE region 1 configuration register,                  Address offset: 0x024 */
  __IOM uint32_t CRR2;            /*!< ICACHE region 2 configuration register,                  Address offset: 0x028 */
  __IOM uint32_t CRR3;            /*!< ICACHE region 3 configuration register,                  Address offset: 0x02C */
} ICACHE_TypeDef;

/**
  * @brief IWDG
  */
typedef struct
{
__OM  uint32_t KR;               /*!< IWDG Key register,             Address offset: 0x00 */
__IOM uint32_t PR;               /*!< IWDG Prescaler register,       Address offset: 0x04 */
__IOM uint32_t RLR;              /*!< IWDG Reload register,          Address offset: 0x08 */
__IM  uint32_t SR;               /*!< IWDG Status register,          Address offset: 0x0C */
__IOM uint32_t WINR;             /*!< IWDG Window register,          Address offset: 0x10 */
__IOM uint32_t EWCR;             /*!< IWDG Early Wakeup register,    Address offset: 0x14 */
__IOM uint32_t ICR;              /*!< IWDG interrupt clear register, Address offset: 0x18 */
} IWDG_TypeDef;

/**
  * @brief LPTIMER
  */
typedef struct
{
__IM  uint32_t ISR;              /*!< LPTIM Interrupt and Status register,    Address offset: 0x00 */
__OM  uint32_t ICR;              /*!< LPTIM Interrupt Clear register,         Address offset: 0x04 */
__IOM uint32_t DIER;             /*!< LPTIM Interrupt Enable register,        Address offset: 0x08 */
__IOM uint32_t CFGR;             /*!< LPTIM Configuration register,           Address offset: 0x0C */
__IOM uint32_t CR;               /*!< LPTIM Control register,                 Address offset: 0x10 */
__IOM uint32_t CCR1;             /*!< LPTIM Capture/Compare register 1,       Address offset: 0x14 */
__IOM uint32_t ARR;              /*!< LPTIM Autoreload register,              Address offset: 0x18 */
__IM  uint32_t CNT;              /*!< LPTIM Counter register,                 Address offset: 0x1C */
      uint32_t RESERVED1;        /*!< Reserved,                               Address offset: 0x20 */
__IOM uint32_t CFGR2;            /*!< LPTIM Configuration register 2,         Address offset: 0x24 */
__IOM uint32_t RCR;              /*!< LPTIM Repetition register,              Address offset: 0x28 */
__IOM uint32_t CCMR1;            /*!< LPTIM Capture/Compare mode register,    Address offset: 0x2C */
      uint32_t RESERVED2;        /*!< Reserved,                               Address offset: 0x30 */
__IOM uint32_t CCR2;             /*!< LPTIM Capture/Compare register 2,       Address offset: 0x34 */
} LPTIM_TypeDef;


/**
  * @brief Power Control (PWR)
  */
typedef struct
{
  __IOM uint32_t PMCR;            /*!< PWR power mode control register,                         Address offset: 0x000 */
  __IM  uint32_t PMSR;            /*!< PWR status register,                                     Address offset: 0x004 */
        uint32_t RESERVED1[7];    /*!< Reserved,                                                Address offset: 0x008 */
  __IOM uint32_t RTCCR;           /*!< PWR RTC domain control register,                         Address offset: 0x024 */
        uint32_t RESERVED2[3];    /*!< Reserved,                                                Address offset: 0x028 */
  __IOM uint32_t VMCR;            /*!< PWR voltage monitor control register,                    Address offset: 0x034 */
        uint32_t RESERVED3;       /*!< Reserved,                                                Address offset: 0x038 */
  __IM  uint32_t VMSR;            /*!< PWR voltage monitor status register,                     Address offset: 0x03C */
  __OM  uint32_t WUSCR;           /*!< PWR wake-up status clear register,                       Address offset: 0x040 */
  __IM  uint32_t WUSR;            /*!< PWR wake-up status register,                             Address offset: 0x044 */
  __IOM uint32_t WUCR;            /*!< PWR wake-up configuration register,                      Address offset: 0x048 */
        uint32_t RESERVED4;       /*!< Reserved,                                                Address offset: 0x04C */
  __IOM uint32_t IORETR;          /*!< PWR I/O retention register,                              Address offset: 0x050 */
        uint32_t RESERVED5[44];   /*!< Reserved,                                                Address offset: 0x054 */
  __IOM uint32_t PRIVCFGR;        /*!< PWR privilege configuration register,                    Address offset: 0x104 */
} PWR_TypeDef;

/**
  * @brief Public key accelerator (PKA)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< PKA control register,                                   Address offset: 0x0000 */
  __IM  uint32_t SR;              /*!< PKA status register,                                    Address offset: 0x0004 */
  __OM  uint32_t CLRFR;           /*!< PKA clear flag register,                                Address offset: 0x0008 */
        uint32_t RESERVED1[253];  /*!< Reserved,                                               Address offset: 0x000C */
  __IOM uint8_t RAM[5336];        /*!< PKA RAM,                                                Address offset: 0x0400 */
} PKA_TypeDef;

/**
  * @brief RAMs configuration controller (RAMCFG)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< RAMCFG control register,                                 Address offset: 0x000 */
  __IOM uint32_t IER;             /*!< RAMCFG interrupt enable register,                        Address offset: 0x004 */
  __IM  uint32_t ISR;             /*!< RAMCFG interrupt status register,                        Address offset: 0x008 */
  __IM  uint32_t SEAR;            /*!< RAMCFG ECC single error address register,                Address offset: 0x00C */
  __IM  uint32_t DEAR;            /*!< RAMCFG ECC double error address register,                Address offset: 0x010 */
  __IOM uint32_t ICR;             /*!< RAMCFG interrupt clear register,                         Address offset: 0x014 */
  __IOM uint32_t WPR1;            /*!< RAMCFG write protection register 1,                      Address offset: 0x018 */
  __IOM uint32_t WPR2;            /*!< RAMCFG write protection register 2,                      Address offset: 0x01C */
        uint32_t RESERVED1;       /*!< Reserved,                                                Address offset: 0x020 */
  __OM  uint32_t ECCKEYR;         /*!< RAMCFG ECC key register,                                 Address offset: 0x024 */
  __OM  uint32_t ERKEYR;          /*!< RAMCFG erase key register,                               Address offset: 0x028 */
        uint32_t RESERVED2;       /*!< Reserved,                                                Address offset: 0x02C */
  __IOM uint32_t WPR3;            /*!< RAMCFG memory 2 write protection register 3              Address offset: 0x030 */
  __IOM uint32_t WPR4;            /*!< RAMCFG memory 2 write protection register 4              Address offset: 0x034 */
} RAMCFG_TypeDef;

/**
  * @brief Reset and clock control (RCC)
  */
typedef struct
{
  __IOM uint32_t CR1;             /*!< RCC clock control register,                              Address offset: 0x000 */
  __IOM uint32_t CR2;             /*!< RCC clock control register,                              Address offset: 0x004 */
        uint32_t RESERVED1[5];    /*!< Reserved,                                                Address offset: 0x008 */
  __IOM uint32_t CFGR1;           /*!< RCC clock configuration register1,                       Address offset: 0x01C */
  __IOM uint32_t CFGR2;           /*!< RCC CPU domain clock configuration register 2,           Address offset: 0x020 */
        uint32_t RESERVED2[11];   /*!< Reserved,                                                Address offset: 0x024 */
  __IOM uint32_t CIER;            /*!< RCC clock source interrupt enable register,              Address offset: 0x050 */
  __IM  uint32_t CIFR;            /*!< RCC clock source interrupt flag register,                Address offset: 0x054 */
  __IOM uint32_t CICR;            /*!< RCC clock source interrupt clear register,               Address offset: 0x058 */
        uint32_t RESERVED3;       /*!< Reserved,                                                Address offset: 0x05C */
  __IOM uint32_t AHB1RSTR;        /*!< RCC AHB1 reset register,                                 Address offset: 0x060 */
  __IOM uint32_t AHB2RSTR;        /*!< RCC AHB2 peripheral reset register,                      Address offset: 0x064 */
        uint32_t RESERVED4;       /*!< Reserved,                                                Address offset: 0x068 */
  __IOM uint32_t AHB4RSTR;        /*!< RCC AHB4 peripheral reset register,                      Address offset: 0x06C */
        uint32_t RESERVED5;       /*!< Reserved,                                                Address offset: 0x070 */
  __IOM uint32_t APB1LRSTR;       /*!< RCC APB1 peripheral low reset register,                  Address offset: 0x074 */
  __IOM uint32_t APB1HRSTR;       /*!< RCC APB1 peripheral high reset register,                 Address offset: 0x078 */
  __IOM uint32_t APB2RSTR;        /*!< RCC APB2 peripheral reset register,                      Address offset: 0x07C */
  __IOM uint32_t APB3RSTR;        /*!< RCC APB3 peripheral reset register,                      Address offset: 0x080 */
        uint32_t RESERVED6;       /*!< Reserved,                                                Address offset: 0x084 */
  __IOM uint32_t AHB1ENR;         /*!< RCC AHB1 peripheral clock register,                      Address offset: 0x088 */
  __IOM uint32_t AHB2ENR;         /*!< RCC AHB2 peripheral clock register,                      Address offset: 0x08C */
        uint32_t RESERVED7;       /*!< Reserved,                                                Address offset: 0x090 */
  __IOM uint32_t AHB4ENR;         /*!< RCC AHB4 peripheral clock register,                      Address offset: 0x094 */
        uint32_t RESERVED8;       /*!< Reserved,                                                Address offset: 0x098 */
  __IOM uint32_t APB1LENR;        /*!< RCC APB1 peripheral clock register,                      Address offset: 0x09C */
  __IOM uint32_t APB1HENR;        /*!< RCC APB1 peripheral clock register,                      Address offset: 0x0A0 */
  __IOM uint32_t APB2ENR;         /*!< RCC APB2 peripheral clock register,                      Address offset: 0x0A4 */
  __IOM uint32_t APB3ENR;         /*!< RCC APB3 peripheral clock register,                      Address offset: 0x0A8 */
        uint32_t RESERVED9;       /*!< Reserved,                                                Address offset: 0x0AC */
  __IOM uint32_t AHB1LPENR;       /*!< RCC AHB1 sleep clock register,                           Address offset: 0x0B0 */
  __IOM uint32_t AHB2LPENR;       /*!< RCC AHB2 sleep clock register,                           Address offset: 0x0B4 */
        uint32_t RESERVED10;      /*!< Reserved,                                                Address offset: 0x0B8 */
  __IOM uint32_t AHB4LPENR;       /*!< RCC AHB4 peripheral sleep clock register,                Address offset: 0x0BC */
        uint32_t RESERVED11;      /*!< Reserved,                                                Address offset: 0x0C0 */
  __IOM uint32_t APB1LLPENR;      /*!< RCC APB1 sleep clock register,                           Address offset: 0x0C4 */
  __IOM uint32_t APB1HLPENR;      /*!< RCC APB1 sleep clock register,                           Address offset: 0x0C8 */
  __IOM uint32_t APB2LPENR;       /*!< RCC APB2 sleep clock register,                           Address offset: 0x0CC */
  __IOM uint32_t APB3LPENR;       /*!< RCC APB3 sleep clock register,                           Address offset: 0x0D0 */
        uint32_t RESERVED12;      /*!< Reserved,                                                Address offset: 0x0D4 */
  __IOM uint32_t CCIPR1;          /*!< RCC kernel clock configuration register,                 Address offset: 0x0D8 */
  __IOM uint32_t CCIPR2;          /*!< RCC kernel clock configuration register,                 Address offset: 0x0DC */
  __IOM uint32_t CCIPR3;          /*!< RCC kernel clock configuration register,                 Address offset: 0x0E0 */
        uint32_t RESERVED13[3];   /*!< Reserved,                                                Address offset: 0x0E4 */
  __IOM uint32_t RTCCR;           /*!< RCC RTC domain control register,                         Address offset: 0x0F0 */
  __IOM uint32_t RSR;             /*!< RCC reset status register,                               Address offset: 0x0F4 */
        uint32_t RESERVED14[7];   /*!< Reserved,                                                Address offset: 0x0F8 */
  __IOM uint32_t PRIVCFGR;        /*!< RCC privilege configuration register,                    Address offset: 0x114 */
} RCC_TypeDef;

/**
  * @brief True random number generator (RNG)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< RNG control register,                      Address offset: 0x00 */
  __IOM uint32_t SR;              /*!< RNG status register,                       Address offset: 0x04 */
  __IM  uint32_t DR;              /*!< RNG data register,                         Address offset: 0x08 */
  __IOM uint32_t NSCR;            /*!< RNG noise source control register,         Address offset: 0x0C */
  __IOM uint32_t HTCR[4];         /*!< RNG health test configuration register,    Address offset: 0x10-0x1C */
  __IM  uint32_t HTSR[2];         /*!< RNG health test status register,           Address offset: 0x20-0x24 */
        uint32_t RESERVED1[2];    /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IOM uint32_t NSMR;            /*!< RNG health test status register,           Address offset: 0x30      */
} RNG_TypeDef;

