MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/**
  * @brief Extended-SPI interface (XSPI)
  */
typedef struct
{
  __IOM uint32_t CR;              /*!< XSPI control register,                                   Address offset: 0x000 */
        uint32_t RESERVED1;       /*!< Reserved,                                                Address offset: 0x004 */
  __IOM uint32_t DCR1;            /*!< XSPI device configuration register 1,                    Address offset: 0x008 */
  __IOM uint32_t DCR2;            /*!< XSPI device configuration register 2,                    Address offset: 0x00C */
  __IOM uint32_t DCR3;            /*!< XSPI device configuration register 3,                    Address offset: 0x010 */
  __IOM uint32_t DCR4;            /*!< XSPI device configuration register 4,                    Address offset: 0x014 */
        uint32_t RESERVED2[2];    /*!< Reserved,                                                Address offset: 0x018 */
  __IM  uint32_t SR;              /*!< XSPI status register,                                    Address offset: 0x020 */
  __OM  uint32_t FCR;             /*!< XSPI flag clear register,                                Address offset: 0x024 */
        uint32_t RESERVED3[6];    /*!< Reserved,                                                Address offset: 0x028 */
  __IOM uint32_t DLR;             /*!< XSPI data length register,                               Address offset: 0x040 */
        uint32_t RESERVED4;       /*!< Reserved,                                                Address offset: 0x044 */
  __IOM uint32_t AR;              /*!< XSPI address register,                                   Address offset: 0x048 */
        uint32_t RESERVED5;       /*!< Reserved,                                                Address offset: 0x04C */
  __IOM uint32_t DR;              /*!< XSPI data register,                                      Address offset: 0x050 */
        uint32_t RESERVED6[11];   /*!< Reserved,                                                Address offset: 0x054 */
  __IOM uint32_t PSMKR;           /*!< XSPI polling status mask register,                       Address offset: 0x080 */
        uint32_t RESERVED7;       /*!< Reserved,                                                Address offset: 0x084 */
  __IOM uint32_t PSMAR;           /*!< XSPI polling status match register,                      Address offset: 0x088 */
        uint32_t RESERVED8;       /*!< Reserved,                                                Address offset: 0x08C */
  __IOM uint32_t PIR;             /*!< XSPI polling interval register,                          Address offset: 0x090 */
        uint32_t RESERVED9[27];   /*!< Reserved,                                                Address offset: 0x094 */
  __IOM uint32_t CCR;             /*!< XSPI communication configuration register,               Address offset: 0x100 */
        uint32_t RESERVED10;      /*!< Reserved,                                                Address offset: 0x104 */
  __IOM uint32_t TCR;             /*!< XSPI timing configuration register,                      Address offset: 0x108 */
        uint32_t RESERVED11;      /*!< Reserved,                                                Address offset: 0x10C */
  __IOM uint32_t IR;              /*!< XSPI instruction register,                               Address offset: 0x110 */
        uint32_t RESERVED12[3];   /*!< Reserved,                                                Address offset: 0x114 */
  __IOM uint32_t ABR;             /*!< XSPI alternate bytes register,                           Address offset: 0x120 */
        uint32_t RESERVED13[3];   /*!< Reserved,                                                Address offset: 0x124 */
  __IOM uint32_t LPTR;            /*!< XSPI low-power timeout register,                         Address offset: 0x130 */
        uint32_t RESERVED14[3];   /*!< Reserved,                                                Address offset: 0x134 */
  __IOM uint32_t WPCCR;           /*!< XSPI wrap communication configuration register,          Address offset: 0x140 */
        uint32_t RESERVED15;      /*!< Reserved,                                                Address offset: 0x144 */
  __IOM uint32_t WPTCR;           /*!< XSPI wrap timing configuration register,                 Address offset: 0x148 */
        uint32_t RESERVED16;      /*!< Reserved,                                                Address offset: 0x14C */
  __IOM uint32_t WPIR;            /*!< XSPI wrap instruction register,                          Address offset: 0x150 */
        uint32_t RESERVED17[3];   /*!< Reserved,                                                Address offset: 0x154 */
  __IOM uint32_t WPABR;           /*!< XSPI wrap alternate bytes register,                      Address offset: 0x160 */
        uint32_t RESERVED18[7];   /*!< Reserved,                                                Address offset: 0x164 */
  __IOM uint32_t WCCR;            /*!< XSPI write communication configuration register,         Address offset: 0x180 */
        uint32_t RESERVED19;      /*!< Reserved,                                                Address offset: 0x184 */
  __IOM uint32_t WTCR;            /*!< XSPI write timing configuration register,                Address offset: 0x188 */
        uint32_t RESERVED20;      /*!< Reserved,                                                Address offset: 0x18C */
  __IOM uint32_t WIR;             /*!< XSPI write instruction register,                         Address offset: 0x190 */
        uint32_t RESERVED21[3];   /*!< Reserved,                                                Address offset: 0x194 */
  __IOM uint32_t WABR;            /*!< XSPI write alternate bytes register,                     Address offset: 0x1A0 */
        uint32_t RESERVED22[23];  /*!< Reserved,                                                Address offset: 0x1A4 */
  __IOM uint32_t HLCR;            /*!< XSPI HyperBus latency configuration register,            Address offset: 0x200 */
} XSPI_TypeDef;

/*@}*/ /* end of group STM32C5xx_peripherals */


/* --------  End of section using anonymous unions and disabling warnings  -------- */
#if   defined (__CC_ARM)
#pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
#pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
#pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
#warning Not supported compiler type
#endif /*__CC_ARM */

