MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* ***********************************  Bit definition for DAC_DHR12R1 register  ************************************ */
#define DAC_DHR12R1_DACC1DHR_Pos   (0U)
#define DAC_DHR12R1_DACC1DHR_Msk   (0xFFFUL << DAC_DHR12R1_DACC1DHR_Pos)   /*!< 0x00000FFF */
#define DAC_DHR12R1_DACC1DHR       DAC_DHR12R1_DACC1DHR_Msk                /*!< DAC channel1 12-bit right-aligned data
                                                                                */
#define DAC_DHR12R1_DACC1DHR_0     (0x1UL << DAC_DHR12R1_DACC1DHR_Pos)     /*!< 0x00000001 */
#define DAC_DHR12R1_DACC1DHR_1     (0x2UL << DAC_DHR12R1_DACC1DHR_Pos)     /*!< 0x00000002 */
#define DAC_DHR12R1_DACC1DHR_2     (0x4UL << DAC_DHR12R1_DACC1DHR_Pos)     /*!< 0x00000004 */
#define DAC_DHR12R1_DACC1DHR_3     (0x8UL << DAC_DHR12R1_DACC1DHR_Pos)     /*!< 0x00000008 */
#define DAC_DHR12R1_DACC1DHR_4     (0x10UL << DAC_DHR12R1_DACC1DHR_Pos)    /*!< 0x00000010 */
#define DAC_DHR12R1_DACC1DHR_5     (0x20UL << DAC_DHR12R1_DACC1DHR_Pos)    /*!< 0x00000020 */
#define DAC_DHR12R1_DACC1DHR_6     (0x40UL << DAC_DHR12R1_DACC1DHR_Pos)    /*!< 0x00000040 */
#define DAC_DHR12R1_DACC1DHR_7     (0x80UL << DAC_DHR12R1_DACC1DHR_Pos)    /*!< 0x00000080 */
#define DAC_DHR12R1_DACC1DHR_8     (0x100UL << DAC_DHR12R1_DACC1DHR_Pos)   /*!< 0x00000100 */
#define DAC_DHR12R1_DACC1DHR_9     (0x200UL << DAC_DHR12R1_DACC1DHR_Pos)   /*!< 0x00000200 */
#define DAC_DHR12R1_DACC1DHR_10    (0x400UL << DAC_DHR12R1_DACC1DHR_Pos)   /*!< 0x00000400 */
#define DAC_DHR12R1_DACC1DHR_11    (0x800UL << DAC_DHR12R1_DACC1DHR_Pos)   /*!< 0x00000800 */
#define DAC_DHR12R1_DACC1DHRB_Pos  (16U)
#define DAC_DHR12R1_DACC1DHRB_Msk  (0xFFFUL << DAC_DHR12R1_DACC1DHRB_Pos)  /*!< 0x0FFF0000 */
#define DAC_DHR12R1_DACC1DHRB      DAC_DHR12R1_DACC1DHRB_Msk               /*!< DAC channel1 12-bit right-aligned data B
                                                                                */
#define DAC_DHR12R1_DACC1DHRB_0    (0x1UL << DAC_DHR12R1_DACC1DHRB_Pos)    /*!< 0x00010000 */
#define DAC_DHR12R1_DACC1DHRB_1    (0x2UL << DAC_DHR12R1_DACC1DHRB_Pos)    /*!< 0x00020000 */
#define DAC_DHR12R1_DACC1DHRB_2    (0x4UL << DAC_DHR12R1_DACC1DHRB_Pos)    /*!< 0x00040000 */
#define DAC_DHR12R1_DACC1DHRB_3    (0x8UL << DAC_DHR12R1_DACC1DHRB_Pos)    /*!< 0x00080000 */
#define DAC_DHR12R1_DACC1DHRB_4    (0x10UL << DAC_DHR12R1_DACC1DHRB_Pos)   /*!< 0x00100000 */
#define DAC_DHR12R1_DACC1DHRB_5    (0x20UL << DAC_DHR12R1_DACC1DHRB_Pos)   /*!< 0x00200000 */
#define DAC_DHR12R1_DACC1DHRB_6    (0x40UL << DAC_DHR12R1_DACC1DHRB_Pos)   /*!< 0x00400000 */
#define DAC_DHR12R1_DACC1DHRB_7    (0x80UL << DAC_DHR12R1_DACC1DHRB_Pos)   /*!< 0x00800000 */
#define DAC_DHR12R1_DACC1DHRB_8    (0x100UL << DAC_DHR12R1_DACC1DHRB_Pos)  /*!< 0x01000000 */
#define DAC_DHR12R1_DACC1DHRB_9    (0x200UL << DAC_DHR12R1_DACC1DHRB_Pos)  /*!< 0x02000000 */
#define DAC_DHR12R1_DACC1DHRB_10   (0x400UL << DAC_DHR12R1_DACC1DHRB_Pos)  /*!< 0x04000000 */
#define DAC_DHR12R1_DACC1DHRB_11   (0x800UL << DAC_DHR12R1_DACC1DHRB_Pos)  /*!< 0x08000000 */

/* ***********************************  Bit definition for DAC_DHR12L1 register  ************************************ */
#define DAC_DHR12L1_DACC1DHR_Pos   (4U)
#define DAC_DHR12L1_DACC1DHR_Msk   (0xFFFUL << DAC_DHR12L1_DACC1DHR_Pos)   /*!< 0x0000FFF0 */
#define DAC_DHR12L1_DACC1DHR       DAC_DHR12L1_DACC1DHR_Msk                /*!< DAC channel1 12-bit left-aligned data */
#define DAC_DHR12L1_DACC1DHR_0     (0x1UL << DAC_DHR12L1_DACC1DHR_Pos)     /*!< 0x00000010 */
#define DAC_DHR12L1_DACC1DHR_1     (0x2UL << DAC_DHR12L1_DACC1DHR_Pos)     /*!< 0x00000020 */
#define DAC_DHR12L1_DACC1DHR_2     (0x4UL << DAC_DHR12L1_DACC1DHR_Pos)     /*!< 0x00000040 */
#define DAC_DHR12L1_DACC1DHR_3     (0x8UL << DAC_DHR12L1_DACC1DHR_Pos)     /*!< 0x00000080 */
#define DAC_DHR12L1_DACC1DHR_4     (0x10UL << DAC_DHR12L1_DACC1DHR_Pos)    /*!< 0x00000100 */
#define DAC_DHR12L1_DACC1DHR_5     (0x20UL << DAC_DHR12L1_DACC1DHR_Pos)    /*!< 0x00000200 */
#define DAC_DHR12L1_DACC1DHR_6     (0x40UL << DAC_DHR12L1_DACC1DHR_Pos)    /*!< 0x00000400 */
#define DAC_DHR12L1_DACC1DHR_7     (0x80UL << DAC_DHR12L1_DACC1DHR_Pos)    /*!< 0x00000800 */
#define DAC_DHR12L1_DACC1DHR_8     (0x100UL << DAC_DHR12L1_DACC1DHR_Pos)   /*!< 0x00001000 */
#define DAC_DHR12L1_DACC1DHR_9     (0x200UL << DAC_DHR12L1_DACC1DHR_Pos)   /*!< 0x00002000 */
#define DAC_DHR12L1_DACC1DHR_10    (0x400UL << DAC_DHR12L1_DACC1DHR_Pos)   /*!< 0x00004000 */
#define DAC_DHR12L1_DACC1DHR_11    (0x800UL << DAC_DHR12L1_DACC1DHR_Pos)   /*!< 0x00008000 */
#define DAC_DHR12L1_DACC1DHRB_Pos  (20U)
#define DAC_DHR12L1_DACC1DHRB_Msk  (0xFFFUL << DAC_DHR12L1_DACC1DHRB_Pos)  /*!< 0xFFF00000 */
#define DAC_DHR12L1_DACC1DHRB      DAC_DHR12L1_DACC1DHRB_Msk               /*!< DAC channel1 12-bit left-aligned data B
                                                                                */
#define DAC_DHR12L1_DACC1DHRB_0    (0x1UL << DAC_DHR12L1_DACC1DHRB_Pos)    /*!< 0x00100000 */
#define DAC_DHR12L1_DACC1DHRB_1    (0x2UL << DAC_DHR12L1_DACC1DHRB_Pos)    /*!< 0x00200000 */
#define DAC_DHR12L1_DACC1DHRB_2    (0x4UL << DAC_DHR12L1_DACC1DHRB_Pos)    /*!< 0x00400000 */
#define DAC_DHR12L1_DACC1DHRB_3    (0x8UL << DAC_DHR12L1_DACC1DHRB_Pos)    /*!< 0x00800000 */
#define DAC_DHR12L1_DACC1DHRB_4    (0x10UL << DAC_DHR12L1_DACC1DHRB_Pos)   /*!< 0x01000000 */
#define DAC_DHR12L1_DACC1DHRB_5    (0x20UL << DAC_DHR12L1_DACC1DHRB_Pos)   /*!< 0x02000000 */
#define DAC_DHR12L1_DACC1DHRB_6    (0x40UL << DAC_DHR12L1_DACC1DHRB_Pos)   /*!< 0x04000000 */
#define DAC_DHR12L1_DACC1DHRB_7    (0x80UL << DAC_DHR12L1_DACC1DHRB_Pos)   /*!< 0x08000000 */
#define DAC_DHR12L1_DACC1DHRB_8    (0x100UL << DAC_DHR12L1_DACC1DHRB_Pos)  /*!< 0x10000000 */
#define DAC_DHR12L1_DACC1DHRB_9    (0x200UL << DAC_DHR12L1_DACC1DHRB_Pos)  /*!< 0x20000000 */
#define DAC_DHR12L1_DACC1DHRB_10   (0x400UL << DAC_DHR12L1_DACC1DHRB_Pos)  /*!< 0x40000000 */
#define DAC_DHR12L1_DACC1DHRB_11   (0x800UL << DAC_DHR12L1_DACC1DHRB_Pos)  /*!< 0x80000000 */

/* ************************************  Bit definition for DAC_DHR8R1 register  ************************************ */
#define DAC_DHR8R1_DACC1DHR_Pos    (0U)
#define DAC_DHR8R1_DACC1DHR_Msk    (0xFFUL << DAC_DHR8R1_DACC1DHR_Pos)     /*!< 0x000000FF */
#define DAC_DHR8R1_DACC1DHR        DAC_DHR8R1_DACC1DHR_Msk                 /*!< DAC channel1 8-bit right-aligned data */
#define DAC_DHR8R1_DACC1DHR_0      (0x1UL << DAC_DHR8R1_DACC1DHR_Pos)      /*!< 0x00000001 */
#define DAC_DHR8R1_DACC1DHR_1      (0x2UL << DAC_DHR8R1_DACC1DHR_Pos)      /*!< 0x00000002 */
#define DAC_DHR8R1_DACC1DHR_2      (0x4UL << DAC_DHR8R1_DACC1DHR_Pos)      /*!< 0x00000004 */
#define DAC_DHR8R1_DACC1DHR_3      (0x8UL << DAC_DHR8R1_DACC1DHR_Pos)      /*!< 0x00000008 */
#define DAC_DHR8R1_DACC1DHR_4      (0x10UL << DAC_DHR8R1_DACC1DHR_Pos)     /*!< 0x00000010 */
#define DAC_DHR8R1_DACC1DHR_5      (0x20UL << DAC_DHR8R1_DACC1DHR_Pos)     /*!< 0x00000020 */
#define DAC_DHR8R1_DACC1DHR_6      (0x40UL << DAC_DHR8R1_DACC1DHR_Pos)     /*!< 0x00000040 */
#define DAC_DHR8R1_DACC1DHR_7      (0x80UL << DAC_DHR8R1_DACC1DHR_Pos)     /*!< 0x00000080 */
#define DAC_DHR8R1_DACC1DHRB_Pos   (8U)
#define DAC_DHR8R1_DACC1DHRB_Msk   (0xFFUL << DAC_DHR8R1_DACC1DHRB_Pos)    /*!< 0x0000FF00 */
#define DAC_DHR8R1_DACC1DHRB       DAC_DHR8R1_DACC1DHRB_Msk                /*!< DAC channel1 8-bit right-aligned data */
#define DAC_DHR8R1_DACC1DHRB_0     (0x1UL << DAC_DHR8R1_DACC1DHRB_Pos)     /*!< 0x00000100 */
#define DAC_DHR8R1_DACC1DHRB_1     (0x2UL << DAC_DHR8R1_DACC1DHRB_Pos)     /*!< 0x00000200 */
#define DAC_DHR8R1_DACC1DHRB_2     (0x4UL << DAC_DHR8R1_DACC1DHRB_Pos)     /*!< 0x00000400 */
#define DAC_DHR8R1_DACC1DHRB_3     (0x8UL << DAC_DHR8R1_DACC1DHRB_Pos)     /*!< 0x00000800 */
#define DAC_DHR8R1_DACC1DHRB_4     (0x10UL << DAC_DHR8R1_DACC1DHRB_Pos)    /*!< 0x00001000 */
#define DAC_DHR8R1_DACC1DHRB_5     (0x20UL << DAC_DHR8R1_DACC1DHRB_Pos)    /*!< 0x00002000 */
#define DAC_DHR8R1_DACC1DHRB_6     (0x40UL << DAC_DHR8R1_DACC1DHRB_Pos)    /*!< 0x00004000 */
#define DAC_DHR8R1_DACC1DHRB_7     (0x80UL << DAC_DHR8R1_DACC1DHRB_Pos)    /*!< 0x00008000 */

/* *************************************  Bit definition for DAC_DOR1 register  ************************************* */
#define DAC_DOR1_DACC1DOR_Pos      (0U)
#define DAC_DOR1_DACC1DOR_Msk      (0xFFFUL << DAC_DOR1_DACC1DOR_Pos)      /*!< 0x00000FFF */
#define DAC_DOR1_DACC1DOR          DAC_DOR1_DACC1DOR_Msk                   /*!< DAC channel1 data output */
#define DAC_DOR1_DACC1DOR_0        (0x1UL << DAC_DOR1_DACC1DOR_Pos)        /*!< 0x00000001 */
#define DAC_DOR1_DACC1DOR_1        (0x2UL << DAC_DOR1_DACC1DOR_Pos)        /*!< 0x00000002 */
#define DAC_DOR1_DACC1DOR_2        (0x4UL << DAC_DOR1_DACC1DOR_Pos)        /*!< 0x00000004 */
#define DAC_DOR1_DACC1DOR_3        (0x8UL << DAC_DOR1_DACC1DOR_Pos)        /*!< 0x00000008 */
#define DAC_DOR1_DACC1DOR_4        (0x10UL << DAC_DOR1_DACC1DOR_Pos)       /*!< 0x00000010 */
#define DAC_DOR1_DACC1DOR_5        (0x20UL << DAC_DOR1_DACC1DOR_Pos)       /*!< 0x00000020 */
#define DAC_DOR1_DACC1DOR_6        (0x40UL << DAC_DOR1_DACC1DOR_Pos)       /*!< 0x00000040 */
#define DAC_DOR1_DACC1DOR_7        (0x80UL << DAC_DOR1_DACC1DOR_Pos)       /*!< 0x00000080 */
#define DAC_DOR1_DACC1DOR_8        (0x100UL << DAC_DOR1_DACC1DOR_Pos)      /*!< 0x00000100 */
#define DAC_DOR1_DACC1DOR_9        (0x200UL << DAC_DOR1_DACC1DOR_Pos)      /*!< 0x00000200 */
#define DAC_DOR1_DACC1DOR_10       (0x400UL << DAC_DOR1_DACC1DOR_Pos)      /*!< 0x00000400 */
#define DAC_DOR1_DACC1DOR_11       (0x800UL << DAC_DOR1_DACC1DOR_Pos)      /*!< 0x00000800 */
#define DAC_DOR1_DACC1DORB_Pos     (16U)
#define DAC_DOR1_DACC1DORB_Msk     (0xFFFUL << DAC_DOR1_DACC1DORB_Pos)     /*!< 0x0FFF0000 */
#define DAC_DOR1_DACC1DORB         DAC_DOR1_DACC1DORB_Msk                  /*!< DAC channel1 data output */
#define DAC_DOR1_DACC1DORB_0       (0x1UL << DAC_DOR1_DACC1DORB_Pos)       /*!< 0x00010000 */
#define DAC_DOR1_DACC1DORB_1       (0x2UL << DAC_DOR1_DACC1DORB_Pos)       /*!< 0x00020000 */
#define DAC_DOR1_DACC1DORB_2       (0x4UL << DAC_DOR1_DACC1DORB_Pos)       /*!< 0x00040000 */
#define DAC_DOR1_DACC1DORB_3       (0x8UL << DAC_DOR1_DACC1DORB_Pos)       /*!< 0x00080000 */
#define DAC_DOR1_DACC1DORB_4       (0x10UL << DAC_DOR1_DACC1DORB_Pos)      /*!< 0x00100000 */
#define DAC_DOR1_DACC1DORB_5       (0x20UL << DAC_DOR1_DACC1DORB_Pos)      /*!< 0x00200000 */
#define DAC_DOR1_DACC1DORB_6       (0x40UL << DAC_DOR1_DACC1DORB_Pos)      /*!< 0x00400000 */
#define DAC_DOR1_DACC1DORB_7       (0x80UL << DAC_DOR1_DACC1DORB_Pos)      /*!< 0x00800000 */
#define DAC_DOR1_DACC1DORB_8       (0x100UL << DAC_DOR1_DACC1DORB_Pos)     /*!< 0x01000000 */
#define DAC_DOR1_DACC1DORB_9       (0x200UL << DAC_DOR1_DACC1DORB_Pos)     /*!< 0x02000000 */
#define DAC_DOR1_DACC1DORB_10      (0x400UL << DAC_DOR1_DACC1DORB_Pos)     /*!< 0x04000000 */
#define DAC_DOR1_DACC1DORB_11      (0x800UL << DAC_DOR1_DACC1DORB_Pos)     /*!< 0x08000000 */

/* **************************************  Bit definition for DAC_SR register  ************************************** */
#define DAC_SR_DAC1RDY_Pos         (11U)
#define DAC_SR_DAC1RDY_Msk         (0x1UL << DAC_SR_DAC1RDY_Pos)           /*!< 0x00000800 */
#define DAC_SR_DAC1RDY             DAC_SR_DAC1RDY_Msk                      /*!< DAC channel1 ready status bit */
#define DAC_SR_DORSTAT1_Pos        (12U)
#define DAC_SR_DORSTAT1_Msk        (0x1UL << DAC_SR_DORSTAT1_Pos)          /*!< 0x00001000 */
#define DAC_SR_DORSTAT1            DAC_SR_DORSTAT1_Msk                     /*!< DAC channel1 output register status bit
                                                                                */
#define DAC_SR_DMAUDR1_Pos         (13U)
#define DAC_SR_DMAUDR1_Msk         (0x1UL << DAC_SR_DMAUDR1_Pos)           /*!< 0x00002000 */
#define DAC_SR_DMAUDR1             DAC_SR_DMAUDR1_Msk                      /*!< DAC channel1 DMA underrun flag */
#define DAC_SR_CAL_FLAG1_Pos       (14U)
#define DAC_SR_CAL_FLAG1_Msk       (0x1UL << DAC_SR_CAL_FLAG1_Pos)         /*!< 0x00004000 */
#define DAC_SR_CAL_FLAG1           DAC_SR_CAL_FLAG1_Msk                    /*!< DAC channel1 calibration offset status
                                                                                */
#define DAC_SR_BWST1_Pos           (15U)
#define DAC_SR_BWST1_Msk           (0x1UL << DAC_SR_BWST1_Pos)             /*!< 0x00008000 */
#define DAC_SR_BWST1               DAC_SR_BWST1_Msk                        /*!< DAC channel1 busy writing sample time
                                                                                flag */

/* *************************************  Bit definition for DAC_CCR register  ************************************** */
#define DAC_CCR_OTRIM1_Pos         (0U)
#define DAC_CCR_OTRIM1_Msk         (0x1FUL << DAC_CCR_OTRIM1_Pos)          /*!< 0x0000001F */
#define DAC_CCR_OTRIM1             DAC_CCR_OTRIM1_Msk                      /*!< DAC channel1 offset trimming value */
#define DAC_CCR_OTRIM1_0           (0x1UL << DAC_CCR_OTRIM1_Pos)           /*!< 0x00000001 */
#define DAC_CCR_OTRIM1_1           (0x2UL << DAC_CCR_OTRIM1_Pos)           /*!< 0x00000002 */
#define DAC_CCR_OTRIM1_2           (0x4UL << DAC_CCR_OTRIM1_Pos)           /*!< 0x00000004 */
#define DAC_CCR_OTRIM1_3           (0x8UL << DAC_CCR_OTRIM1_Pos)           /*!< 0x00000008 */
#define DAC_CCR_OTRIM1_4           (0x10UL << DAC_CCR_OTRIM1_Pos)          /*!< 0x00000010 */

/* *************************************  Bit definition for DAC_MCR register  ************************************** */
#define DAC_MCR_MODE1_Pos          (0U)
#define DAC_MCR_MODE1_Msk          (0x7UL << DAC_MCR_MODE1_Pos)            /*!< 0x00000007 */
#define DAC_MCR_MODE1              DAC_MCR_MODE1_Msk                       /*!< DAC channel1 mode */
#define DAC_MCR_MODE1_0            (0x1UL << DAC_MCR_MODE1_Pos)            /*!< 0x00000001 */
#define DAC_MCR_MODE1_1            (0x2UL << DAC_MCR_MODE1_Pos)            /*!< 0x00000002 */
#define DAC_MCR_MODE1_2            (0x4UL << DAC_MCR_MODE1_Pos)            /*!< 0x00000004 */
#define DAC_MCR_DMADOUBLE1_Pos     (8U)
#define DAC_MCR_DMADOUBLE1_Msk     (0x1UL << DAC_MCR_DMADOUBLE1_Pos)       /*!< 0x00000100 */
#define DAC_MCR_DMADOUBLE1         DAC_MCR_DMADOUBLE1_Msk                  /*!< DAC channel1 DMA double data mode */
#define DAC_MCR_SINFORMAT1_Pos     (9U)
#define DAC_MCR_SINFORMAT1_Msk     (0x1UL << DAC_MCR_SINFORMAT1_Pos)       /*!< 0x00000200 */
#define DAC_MCR_SINFORMAT1         DAC_MCR_SINFORMAT1_Msk                  /*!< Enable signed format for DAC channel1 */
#define DAC_MCR_HFSEL_Pos          (13U)
#define DAC_MCR_HFSEL_Msk          (0x7UL << DAC_MCR_HFSEL_Pos)            /*!< 0x0000E000 */
#define DAC_MCR_HFSEL              DAC_MCR_HFSEL_Msk                       /*!< High frequency interface mode selection
                                                                                */
#define DAC_MCR_HFSEL_0            (0x1UL << DAC_MCR_HFSEL_Pos)            /*!< 0x00002000 */
#define DAC_MCR_HFSEL_1            (0x2UL << DAC_MCR_HFSEL_Pos)            /*!< 0x00004000 */
#define DAC_MCR_HFSEL_2            (0x4UL << DAC_MCR_HFSEL_Pos)            /*!< 0x00008000 */

