MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* **********************************  Bit definition for ETH_MACMDIODR register  *********************************** */
#define ETH_MACMDIODR_MD_Pos           (0U)
#define ETH_MACMDIODR_MD_Msk           (0xFFFFUL << ETH_MACMDIODR_MD_Pos)          /*!< 0x0000FFFF */
#define ETH_MACMDIODR_MD               ETH_MACMDIODR_MD_Msk                        /*!< MII Data */
#define ETH_MACMDIODR_MAX_BC_Pos       (0U)
#define ETH_MACMDIODR_MAX_BC_Msk       (0xFFUL << ETH_MACMDIODR_MAX_BC_Pos)        /*!< 0x000000FF */
#define ETH_MACMDIODR_MAX_BC           ETH_MACMDIODR_MAX_BC_Msk                    /*!< Maximum additional packets in
                                                                                        burst mode */
#define ETH_MACMDIODR_PNC_Pos          (0U)
#define ETH_MACMDIODR_PNC_Msk          (0xFFUL << ETH_MACMDIODR_PNC_Pos)           /*!< 0x000000FF */
#define ETH_MACMDIODR_PNC              ETH_MACMDIODR_PNC_Msk                       /*!< PLCA node count */
#define ETH_MACMDIODR_TOT_Pos          (0U)
#define ETH_MACMDIODR_TOT_Msk          (0xFFUL << ETH_MACMDIODR_TOT_Pos)           /*!< 0x000000FF */
#define ETH_MACMDIODR_TOT              ETH_MACMDIODR_TOT_Msk                       /*!< Transmit opportunity timer */
#define ETH_MACMDIODR_PS_Pos           (0U)
#define ETH_MACMDIODR_PS_Msk           (0x1UL << ETH_MACMDIODR_PS_Pos)             /*!< 0x00000001 */
#define ETH_MACMDIODR_PS               ETH_MACMDIODR_PS_Msk                        /*!< PLCA status */
#define ETH_MACMDIODR_PVBD_Pos         (0U)
#define ETH_MACMDIODR_PVBD_Msk         (0x7FUL << ETH_MACMDIODR_PVBD_Pos)          /*!< 0x0000007F */
#define ETH_MACMDIODR_PVBD             ETH_MACMDIODR_PVBD_Msk                      /*!< PLCA Variable Buffer Depth */
#define ETH_MACMDIODR_RJC_Pos          (0U)
#define ETH_MACMDIODR_RJC_Msk          (0xFFFFUL << ETH_MACMDIODR_RJC_Pos)         /*!< 0x0000FFFF */
#define ETH_MACMDIODR_RJC              ETH_MACMDIODR_RJC_Msk                       /*!< Remote jabber counter */
#define ETH_MACMDIODR_CTC_Pos          (0U)
#define ETH_MACMDIODR_CTC_Msk          (0xFFFFUL << ETH_MACMDIODR_CTC_Pos)         /*!< 0x0000FFFF */
#define ETH_MACMDIODR_CTC              ETH_MACMDIODR_CTC_Msk                       /*!< Corrupted TX count */
#define ETH_MACMDIODR_PJT_Pos          (0U)
#define ETH_MACMDIODR_PJT_Msk          (0xFFFFUL << ETH_MACMDIODR_PJT_Pos)         /*!< 0x0000FFFF */
#define ETH_MACMDIODR_PJT              ETH_MACMDIODR_PJT_Msk                       /*!< PCS unjab timer */
#define ETH_MACMDIODR_TS_Pos           (0U)
#define ETH_MACMDIODR_TS_Msk           (0xFUL << ETH_MACMDIODR_TS_Pos)             /*!< 0x0000000F */
#define ETH_MACMDIODR_TS               ETH_MACMDIODR_TS_Msk                        /*!< Type selection */
#define ETH_MACMDIODR_ALT_LB_Pos       (0U)
#define ETH_MACMDIODR_ALT_LB_Msk       (0x1UL << ETH_MACMDIODR_ALT_LB_Pos)         /*!< 0x00000001 */
#define ETH_MACMDIODR_ALT_LB           ETH_MACMDIODR_ALT_LB_Msk                    /*!< Loopback enable */
#define ETH_MACMDIODR_PSB_Pos          (0U)
#define ETH_MACMDIODR_PSB_Msk          (0x1UL << ETH_MACMDIODR_PSB_Pos)            /*!< 0x00000001 */
#define ETH_MACMDIODR_PSB              ETH_MACMDIODR_PSB_Msk                       /*!< PCS scrambler bypass */
#define ETH_MACMDIODR_BCNBFTO_Pos      (1U)
#define ETH_MACMDIODR_BCNBFTO_Msk      (0x1UL << ETH_MACMDIODR_BCNBFTO_Pos)        /*!< 0x00000002 */
#define ETH_MACMDIODR_BCNBFTO          ETH_MACMDIODR_BCNBFTO_Msk                   /*!< PCLA BEACON received before
                                                                                        transmit opportunity */
#define ETH_MACMDIODR_EBRTH_Pos        (1U)
#define ETH_MACMDIODR_EBRTH_Msk        (0x1FUL << ETH_MACMDIODR_EBRTH_Pos)         /*!< 0x0000003E */
#define ETH_MACMDIODR_EBRTH            ETH_MACMDIODR_EBRTH_Msk                     /*!< Elastic buffer reading threshold
                                                                                        */
#define ETH_MACMDIODR_RFD_Pos          (1U)
#define ETH_MACMDIODR_RFD_Msk          (0x1UL << ETH_MACMDIODR_RFD_Pos)            /*!< 0x00000002 */
#define ETH_MACMDIODR_RFD              ETH_MACMDIODR_RFD_Msk                       /*!< Receive fault detection */
#define ETH_MACMDIODR_PDB_Pos          (1U)
#define ETH_MACMDIODR_PDB_Msk          (0x1UL << ETH_MACMDIODR_PDB_Pos)            /*!< 0x00000002 */
#define ETH_MACMDIODR_PDB              ETH_MACMDIODR_PDB_Msk                       /*!< PCS descrambler bypass */
#define ETH_MACMDIODR_UNEXPB_Pos       (2U)
#define ETH_MACMDIODR_UNEXPB_Msk       (0x1UL << ETH_MACMDIODR_UNEXPB_Pos)         /*!< 0x00000004 */
#define ETH_MACMDIODR_UNEXPB           ETH_MACMDIODR_UNEXPB_Msk                    /*!< Unexpected BEACON */
#define ETH_MACMDIODR_RXINTO_Pos       (3U)
#define ETH_MACMDIODR_RXINTO_Msk       (0x1UL << ETH_MACMDIODR_RXINTO_Pos)         /*!< 0x00000008 */
#define ETH_MACMDIODR_RXINTO           ETH_MACMDIODR_RXINTO_Msk                    /*!< PLCA receive in assigned
                                                                                        transmit opportunity */
#define ETH_MACMDIODR_T1SA_Pos         (3U)
#define ETH_MACMDIODR_T1SA_Msk         (0x1UL << ETH_MACMDIODR_T1SA_Pos)           /*!< 0x00000008 */
#define ETH_MACMDIODR_T1SA             ETH_MACMDIODR_T1SA_Msk                      /*!< 10BASE-T1S ability */
#define ETH_MACMDIODR_FAULT_Pos        (7U)
#define ETH_MACMDIODR_FAULT_Msk        (0x1UL << ETH_MACMDIODR_FAULT_Pos)          /*!< 0x00000080 */
#define ETH_MACMDIODR_FAULT            ETH_MACMDIODR_FAULT_Msk                     /*!< This bit indicates that the
                                                                                        10BASE-T1S PCS has detected a
                                                                                        fault condition either on the
                                                                                        transmit or on the receive path.
                                                                                        */
#define ETH_MACMDIODR_LNI_Pos          (8U)
#define ETH_MACMDIODR_LNI_Msk          (0xFFUL << ETH_MACMDIODR_LNI_Pos)           /*!< 0x0000FF00 */
#define ETH_MACMDIODR_LNI              ETH_MACMDIODR_LNI_Msk                       /*!< Local_nodeID */
#define ETH_MACMDIODR_BT_Pos           (8U)
#define ETH_MACMDIODR_BT_Msk           (0xFFUL << ETH_MACMDIODR_BT_Pos)            /*!< 0x0000FF00 */
#define ETH_MACMDIODR_BT               ETH_MACMDIODR_BT_Msk                        /*!< Burst timer */
#define ETH_MACMDIODR_DM_Pos           (8U)
#define ETH_MACMDIODR_DM_Msk           (0x1UL << ETH_MACMDIODR_DM_Pos)             /*!< 0x00000100 */
#define ETH_MACMDIODR_DM               ETH_MACMDIODR_DM_Msk                        /*!< Duplex mode */
#define ETH_MACMDIODR_PCB_Pos          (9U)
#define ETH_MACMDIODR_PCB_Msk          (0x1UL << ETH_MACMDIODR_PCB_Pos)            /*!< 0x00000200 */
#define ETH_MACMDIODR_PCB              ETH_MACMDIODR_PCB_Msk                       /*!< PCS collision bit */
#define ETH_MACMDIODR_RFA_Pos          (9U)
#define ETH_MACMDIODR_RFA_Msk          (0x1UL << ETH_MACMDIODR_RFA_Pos)            /*!< 0x00000200 */
#define ETH_MACMDIODR_RFA              ETH_MACMDIODR_RFA_Msk                       /*!< Receive fault ability */
#define ETH_MACMDIODR_MM_Pos           (10U)
#define ETH_MACMDIODR_MM_Msk           (0x1UL << ETH_MACMDIODR_MM_Pos)             /*!< 0x00000400 */
#define ETH_MACMDIODR_MM               ETH_MACMDIODR_MM_Msk                        /*!< Multidrop mode */
#define ETH_MACMDIODR_MMA_Pos          (10U)
#define ETH_MACMDIODR_MMA_Msk          (0x1UL << ETH_MACMDIODR_MMA_Pos)            /*!< 0x00000400 */
#define ETH_MACMDIODR_MMA              ETH_MACMDIODR_MMA_Msk                       /*!< Multidrop mode ability */
#define ETH_MACMDIODR_LP_Pos           (11U)
#define ETH_MACMDIODR_LP_Msk           (0x1UL << ETH_MACMDIODR_LP_Pos)             /*!< 0x00000800 */
#define ETH_MACMDIODR_LP               ETH_MACMDIODR_LP_Msk                        /*!< Low power */
#define ETH_MACMDIODR_LPA_Pos          (11U)
#define ETH_MACMDIODR_LPA_Msk          (0x1UL << ETH_MACMDIODR_LPA_Pos)            /*!< 0x00000800 */
#define ETH_MACMDIODR_LPA              ETH_MACMDIODR_LPA_Msk                       /*!< Low-power ability */
#define ETH_MACMDIODR_LBA_Pos          (13U)
#define ETH_MACMDIODR_LBA_Msk          (0x1UL << ETH_MACMDIODR_LBA_Pos)            /*!< 0x00002000 */
#define ETH_MACMDIODR_LBA              ETH_MACMDIODR_LBA_Msk                       /*!< Loopback ability */
#define ETH_MACMDIODR_TMC_Pos          (13U)
#define ETH_MACMDIODR_TMC_Msk          (0x7UL << ETH_MACMDIODR_TMC_Pos)            /*!< 0x0000E000 */
#define ETH_MACMDIODR_TMC              ETH_MACMDIODR_TMC_Msk                       /*!< Test mode control */
#define ETH_MACMDIODR_PLCA_EN_Pos      (14U)
#define ETH_MACMDIODR_PLCA_EN_Msk      (0x1UL << ETH_MACMDIODR_PLCA_EN_Pos)        /*!< 0x00004000 */
#define ETH_MACMDIODR_PLCA_EN          ETH_MACMDIODR_PLCA_EN_Msk                   /*!< PLCA functionality enable */
#define ETH_MACMDIODR_LB_Pos           (14U)
#define ETH_MACMDIODR_LB_Msk           (0x1UL << ETH_MACMDIODR_LB_Pos)             /*!< 0x00004000 */
#define ETH_MACMDIODR_LB               ETH_MACMDIODR_LB_Msk                        /*!< Loopback mode */
#define ETH_MACMDIODR_MSCV_Pos         (14U)
#define ETH_MACMDIODR_MSCV_Msk         (0x1UL << ETH_MACMDIODR_MSCV_Pos)           /*!< 0x00004000 */
#define ETH_MACMDIODR_MSCV             ETH_MACMDIODR_MSCV_Msk                      /*!< Master/slave configuration value
                                                                                        */
#define ETH_MACMDIODR_TD_Pos           (14U)
#define ETH_MACMDIODR_TD_Msk           (0x1UL << ETH_MACMDIODR_TD_Pos)             /*!< 0x00004000 */
#define ETH_MACMDIODR_TD               ETH_MACMDIODR_TD_Msk                        /*!< Transmit disable */
#define ETH_MACMDIODR_PLCA_R_Pos       (15U)
#define ETH_MACMDIODR_PLCA_R_Msk       (0x1UL << ETH_MACMDIODR_PLCA_R_Pos)         /*!< 0x00008000 */
#define ETH_MACMDIODR_PLCA_R           ETH_MACMDIODR_PLCA_R_Msk                    /*!< PLCA software reset */
#define ETH_MACMDIODR_PCS_R_Pos        (15U)
#define ETH_MACMDIODR_PCS_R_Msk        (0x1UL << ETH_MACMDIODR_PCS_R_Pos)          /*!< 0x00008000 */
#define ETH_MACMDIODR_PCS_R            ETH_MACMDIODR_PCS_R_Msk                     /*!< PCS reset */
#define ETH_MACMDIODR_PMA_R_Pos        (15U)
#define ETH_MACMDIODR_PMA_R_Msk        (0x1UL << ETH_MACMDIODR_PMA_R_Pos)          /*!< 0x00008000 */
#define ETH_MACMDIODR_PMA_R            ETH_MACMDIODR_PMA_R_Msk                     /*!< PMA reset */
#define ETH_MACMDIODR_RA_Pos           (16U)
#define ETH_MACMDIODR_RA_Msk           (0xFFFFUL << ETH_MACMDIODR_RA_Pos)          /*!< 0xFFFF0000 */
#define ETH_MACMDIODR_RA               ETH_MACMDIODR_RA_Msk                        /*!< Register Address */

