MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* ***********************************  Bit definition for ETH_MACARPAR register  *********************************** */
#define ETH_MACARPAR_ARPPA_Pos         (0U)
#define ETH_MACARPAR_ARPPA_Msk         (0xFFFFFFFFUL << ETH_MACARPAR_ARPPA_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACARPAR_ARPPA             ETH_MACARPAR_ARPPA_Msk                      /*!< ARP Protocol Address */

/* **********************************  Bit definition for ETH_MACCSRSWCR register  ********************************** */
#define ETH_MACCSRSWCR_RCWE_Pos        (0U)
#define ETH_MACCSRSWCR_RCWE_Msk        (0x1UL << ETH_MACCSRSWCR_RCWE_Pos)          /*!< 0x00000001 */
#define ETH_MACCSRSWCR_RCWE            ETH_MACCSRSWCR_RCWE_Msk                     /*!< Register Clear on Write 1 Enable
                                                                                        */
#define ETH_MACCSRSWCR_SEEN_Pos        (8U)
#define ETH_MACCSRSWCR_SEEN_Msk        (0x1UL << ETH_MACCSRSWCR_SEEN_Pos)          /*!< 0x00000100 */
#define ETH_MACCSRSWCR_SEEN            ETH_MACCSRSWCR_SEEN_Msk                     /*!< Slave Error Response Enable */

/* **********************************  Bit definition for ETH_MACPRSTIMR register  ********************************** */
#define ETH_MACPRSTIMR_MPTN_Pos        (0U)
#define ETH_MACPRSTIMR_MPTN_Msk        (0xFFFFFFFFUL << ETH_MACPRSTIMR_MPTN_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACPRSTIMR_MPTN            ETH_MACPRSTIMR_MPTN_Msk                     /*!< MAC 1722 Presentation Time in ns
                                                                                        */

/* *********************************  Bit definition for ETH_MACPRSTIMUR register  ********************************** */
#define ETH_MACPRSTIMUR_MPTU_Pos       (0U)
#define ETH_MACPRSTIMUR_MPTU_Msk       (0xFFFFFFFFUL << ETH_MACPRSTIMUR_MPTU_Pos)  /*!< 0xFFFFFFFF */
#define ETH_MACPRSTIMUR_MPTU           ETH_MACPRSTIMUR_MPTU_Msk                    /*!< MAC 1722 Presentation Time
                                                                                        Update */

/* ***********************************  Bit definition for ETH_MACA0HR register  ************************************ */
#define ETH_MACA0HR_ADDRHI_Pos         (0U)
#define ETH_MACA0HR_ADDRHI_Msk         (0xFFFFUL << ETH_MACA0HR_ADDRHI_Pos)        /*!< 0x0000FFFF */
#define ETH_MACA0HR_ADDRHI             ETH_MACA0HR_ADDRHI_Msk                      /*!< MAC Address0[47:32] */
#define ETH_MACA0HR_AE_Pos             (31U)
#define ETH_MACA0HR_AE_Msk             (0x1UL << ETH_MACA0HR_AE_Pos)               /*!< 0x80000000 */
#define ETH_MACA0HR_AE                 ETH_MACA0HR_AE_Msk                          /*!< Address Enable */

/* ***********************************  Bit definition for ETH_MACA0LR register  ************************************ */
#define ETH_MACA0LR_ADDRLO_Pos         (0U)
#define ETH_MACA0LR_ADDRLO_Msk         (0xFFFFFFFFUL << ETH_MACA0LR_ADDRLO_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACA0LR_ADDRLO             ETH_MACA0LR_ADDRLO_Msk                      /*!< MAC Address x [31:0] */

/* ***********************************  Bit definition for ETH_MACA1HR register  ************************************ */
#define ETH_MACA1HR_ADDRHI_Pos         (0U)
#define ETH_MACA1HR_ADDRHI_Msk         (0xFFFFUL << ETH_MACA1HR_ADDRHI_Pos)        /*!< 0x0000FFFF */
#define ETH_MACA1HR_ADDRHI             ETH_MACA1HR_ADDRHI_Msk                      /*!< MAC Address1 [47:32] */
#define ETH_MACA1HR_MBC_Pos            (24U)
#define ETH_MACA1HR_MBC_Msk            (0x3FUL << ETH_MACA1HR_MBC_Pos)             /*!< 0x3F000000 */
#define ETH_MACA1HR_MBC                ETH_MACA1HR_MBC_Msk                         /*!< Mask Byte Control */
#define ETH_MACA1HR_SA_Pos             (30U)
#define ETH_MACA1HR_SA_Msk             (0x1UL << ETH_MACA1HR_SA_Pos)               /*!< 0x40000000 */
#define ETH_MACA1HR_SA                 ETH_MACA1HR_SA_Msk                          /*!< Source Address */
#define ETH_MACA1HR_AE_Pos             (31U)
#define ETH_MACA1HR_AE_Msk             (0x1UL << ETH_MACA1HR_AE_Pos)               /*!< 0x80000000 */
#define ETH_MACA1HR_AE                 ETH_MACA1HR_AE_Msk                          /*!< Address Enable */

/* ***********************************  Bit definition for ETH_MACA1LR register  ************************************ */
#define ETH_MACA1LR_ADDRLO_Pos         (0U)
#define ETH_MACA1LR_ADDRLO_Msk         (0xFFFFFFFFUL << ETH_MACA1LR_ADDRLO_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACA1LR_ADDRLO             ETH_MACA1LR_ADDRLO_Msk                      /*!< MAC Address x [31:0] */

/* ***********************************  Bit definition for ETH_MACA2HR register  ************************************ */
#define ETH_MACA2HR_ADDRHI_Pos         (0U)
#define ETH_MACA2HR_ADDRHI_Msk         (0xFFFFUL << ETH_MACA2HR_ADDRHI_Pos)        /*!< 0x0000FFFF */
#define ETH_MACA2HR_ADDRHI             ETH_MACA2HR_ADDRHI_Msk                      /*!< MAC Address1 [47:32] */
#define ETH_MACA2HR_MBC_Pos            (24U)
#define ETH_MACA2HR_MBC_Msk            (0x3FUL << ETH_MACA2HR_MBC_Pos)             /*!< 0x3F000000 */
#define ETH_MACA2HR_MBC                ETH_MACA2HR_MBC_Msk                         /*!< Mask Byte Control */
#define ETH_MACA2HR_SA_Pos             (30U)
#define ETH_MACA2HR_SA_Msk             (0x1UL << ETH_MACA2HR_SA_Pos)               /*!< 0x40000000 */
#define ETH_MACA2HR_SA                 ETH_MACA2HR_SA_Msk                          /*!< Source Address */
#define ETH_MACA2HR_AE_Pos             (31U)
#define ETH_MACA2HR_AE_Msk             (0x1UL << ETH_MACA2HR_AE_Pos)               /*!< 0x80000000 */
#define ETH_MACA2HR_AE                 ETH_MACA2HR_AE_Msk                          /*!< Address Enable */

/* ***********************************  Bit definition for ETH_MACA2LR register  ************************************ */
#define ETH_MACA2LR_ADDRLO_Pos         (0U)
#define ETH_MACA2LR_ADDRLO_Msk         (0xFFFFFFFFUL << ETH_MACA2LR_ADDRLO_Pos)    /*!< 0xFFFFFFFF */
#define ETH_MACA2LR_ADDRLO             ETH_MACA2LR_ADDRLO_Msk                      /*!< MAC Address x [31:0] */

/* ***********************************  Bit definition for ETH_MACA3HR register  ************************************ */
#define ETH_MACA3HR_ADDRHI_Pos         (0U)
#define ETH_MACA3HR_ADDRHI_Msk         (0xFFFFUL << ETH_MACA3HR_ADDRHI_Pos)        /*!< 0x0000FFFF */
#define ETH_MACA3HR_ADDRHI             ETH_MACA3HR_ADDRHI_Msk                      /*!< MAC Address1 [47:32] */
#define ETH_MACA3HR_MBC_Pos            (24U)
#define ETH_MACA3HR_MBC_Msk            (0x3FUL << ETH_MACA3HR_MBC_Pos)             /*!< 0x3F000000 */
#define ETH_MACA3HR_MBC                ETH_MACA3HR_MBC_Msk                         /*!< Mask Byte Control */
#define ETH_MACA3HR_SA_Pos             (30U)
#define ETH_MACA3HR_SA_Msk             (0x1UL << ETH_MACA3HR_SA_Pos)               /*!< 0x40000000 */
#define ETH_MACA3HR_SA                 ETH_MACA3HR_SA_Msk                          /*!< Source Address */
#define ETH_MACA3HR_AE_Pos             (31U)
#define ETH_MACA3HR_AE_Msk             (0x1UL << ETH_MACA3HR_AE_Pos)               /*!< 0x80000000 */
#define ETH_MACA3HR_AE                 ETH_MACA3HR_AE_Msk                          /*!< Address Enable */

