MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* **********************************  Bit definition for ETH_MACL3A20R register  *********************************** */
#define ETH_MACL3A20R_L3A20_Pos        (0U)
#define ETH_MACL3A20R_L3A20_Msk        (0xFFFFFFFFUL << ETH_MACL3A20R_L3A20_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A20R_L3A20            ETH_MACL3A20R_L3A20_Msk                     /*!< Layer 3 Address 2 Field */

/* **********************************  Bit definition for ETH_MACL3A30R register  *********************************** */
#define ETH_MACL3A30R_L3A30_Pos        (0U)
#define ETH_MACL3A30R_L3A30_Msk        (0xFFFFFFFFUL << ETH_MACL3A30R_L3A30_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A30R_L3A30            ETH_MACL3A30R_L3A30_Msk                     /*!< Layer 3 Address 3 Field */

/* **********************************  Bit definition for ETH_MACL3L4C1R register  ********************************** */
#define ETH_MACL3L4C1R_L3PEN1_Pos      (0U)
#define ETH_MACL3L4C1R_L3PEN1_Msk      (0x1UL << ETH_MACL3L4C1R_L3PEN1_Pos)        /*!< 0x00000001 */
#define ETH_MACL3L4C1R_L3PEN1          ETH_MACL3L4C1R_L3PEN1_Msk                   /*!< Layer 3 Protocol Enable */
#define ETH_MACL3L4C1R_L3SAM1_Pos      (2U)
#define ETH_MACL3L4C1R_L3SAM1_Msk      (0x1UL << ETH_MACL3L4C1R_L3SAM1_Pos)        /*!< 0x00000004 */
#define ETH_MACL3L4C1R_L3SAM1          ETH_MACL3L4C1R_L3SAM1_Msk                   /*!< Layer 3 IP SA Match Enable */
#define ETH_MACL3L4C1R_L3SAIM1_Pos     (3U)
#define ETH_MACL3L4C1R_L3SAIM1_Msk     (0x1UL << ETH_MACL3L4C1R_L3SAIM1_Pos)       /*!< 0x00000008 */
#define ETH_MACL3L4C1R_L3SAIM1         ETH_MACL3L4C1R_L3SAIM1_Msk                  /*!< Layer 3 IP SA Inverse Match
                                                                                        Enable */
#define ETH_MACL3L4C1R_L3DAM1_Pos      (4U)
#define ETH_MACL3L4C1R_L3DAM1_Msk      (0x1UL << ETH_MACL3L4C1R_L3DAM1_Pos)        /*!< 0x00000010 */
#define ETH_MACL3L4C1R_L3DAM1          ETH_MACL3L4C1R_L3DAM1_Msk                   /*!< Layer 3 IP DA Match Enable */
#define ETH_MACL3L4C1R_L3DAIM1_Pos     (5U)
#define ETH_MACL3L4C1R_L3DAIM1_Msk     (0x1UL << ETH_MACL3L4C1R_L3DAIM1_Pos)       /*!< 0x00000020 */
#define ETH_MACL3L4C1R_L3DAIM1         ETH_MACL3L4C1R_L3DAIM1_Msk                  /*!< Layer 3 IP DA Inverse Match
                                                                                        Enable */
#define ETH_MACL3L4C1R_L3HSBM1_Pos     (6U)
#define ETH_MACL3L4C1R_L3HSBM1_Msk     (0x1FUL << ETH_MACL3L4C1R_L3HSBM1_Pos)      /*!< 0x000007C0 */
#define ETH_MACL3L4C1R_L3HSBM1         ETH_MACL3L4C1R_L3HSBM1_Msk                  /*!< Layer 3 IP SA Higher Bits Match
                                                                                        */
#define ETH_MACL3L4C1R_L3HDBM1_Pos     (11U)
#define ETH_MACL3L4C1R_L3HDBM1_Msk     (0x1FUL << ETH_MACL3L4C1R_L3HDBM1_Pos)      /*!< 0x0000F800 */
#define ETH_MACL3L4C1R_L3HDBM1         ETH_MACL3L4C1R_L3HDBM1_Msk                  /*!< Layer 3 IP DA higher bits match
                                                                                        */
#define ETH_MACL3L4C1R_L4PEN1_Pos      (16U)
#define ETH_MACL3L4C1R_L4PEN1_Msk      (0x1UL << ETH_MACL3L4C1R_L4PEN1_Pos)        /*!< 0x00010000 */
#define ETH_MACL3L4C1R_L4PEN1          ETH_MACL3L4C1R_L4PEN1_Msk                   /*!< Layer 4 Protocol Enable */
#define ETH_MACL3L4C1R_L4SPM1_Pos      (18U)
#define ETH_MACL3L4C1R_L4SPM1_Msk      (0x1UL << ETH_MACL3L4C1R_L4SPM1_Pos)        /*!< 0x00040000 */
#define ETH_MACL3L4C1R_L4SPM1          ETH_MACL3L4C1R_L4SPM1_Msk                   /*!< Layer 4 Source Port Match Enable
                                                                                        */
#define ETH_MACL3L4C1R_L4SPIM1_Pos     (19U)
#define ETH_MACL3L4C1R_L4SPIM1_Msk     (0x1UL << ETH_MACL3L4C1R_L4SPIM1_Pos)       /*!< 0x00080000 */
#define ETH_MACL3L4C1R_L4SPIM1         ETH_MACL3L4C1R_L4SPIM1_Msk                  /*!< Layer 4 Source Port Inverse
                                                                                        Match Enable */
#define ETH_MACL3L4C1R_L4DPM1_Pos      (20U)
#define ETH_MACL3L4C1R_L4DPM1_Msk      (0x1UL << ETH_MACL3L4C1R_L4DPM1_Pos)        /*!< 0x00100000 */
#define ETH_MACL3L4C1R_L4DPM1          ETH_MACL3L4C1R_L4DPM1_Msk                   /*!< Layer 4 Destination Port Match
                                                                                        Enable */
#define ETH_MACL3L4C1R_L4DPIM1_Pos     (21U)
#define ETH_MACL3L4C1R_L4DPIM1_Msk     (0x1UL << ETH_MACL3L4C1R_L4DPIM1_Pos)       /*!< 0x00200000 */
#define ETH_MACL3L4C1R_L4DPIM1         ETH_MACL3L4C1R_L4DPIM1_Msk                  /*!< Layer 4 Destination Port Inverse
                                                                                        Match Enable */

/* ***********************************  Bit definition for ETH_MACL4A1R register  *********************************** */
#define ETH_MACL4A1R_L4SP1_Pos         (0U)
#define ETH_MACL4A1R_L4SP1_Msk         (0xFFFFUL << ETH_MACL4A1R_L4SP1_Pos)        /*!< 0x0000FFFF */
#define ETH_MACL4A1R_L4SP1             ETH_MACL4A1R_L4SP1_Msk                      /*!< Layer 4 Source Port Number Field
                                                                                        */
#define ETH_MACL4A1R_L4DP1_Pos         (16U)
#define ETH_MACL4A1R_L4DP1_Msk         (0xFFFFUL << ETH_MACL4A1R_L4DP1_Pos)        /*!< 0xFFFF0000 */
#define ETH_MACL4A1R_L4DP1             ETH_MACL4A1R_L4DP1_Msk                      /*!< Layer 4 Destination Port Number
                                                                                        Field */

/* **********************************  Bit definition for ETH_MACL3A01R register  *********************************** */
#define ETH_MACL3A01R_L3A01_Pos        (0U)
#define ETH_MACL3A01R_L3A01_Msk        (0xFFFFFFFFUL << ETH_MACL3A01R_L3A01_Pos)   /*!< 0xFFFFFFFF */
#define ETH_MACL3A01R_L3A01            ETH_MACL3A01R_L3A01_Msk                     /*!< Layer 3 Address 0 Field */

