MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* ************************************  Bit definition for ETH_MTLOMR register  ************************************ */
#define ETH_MTLOMR_DTXSTS_Pos          (1U)
#define ETH_MTLOMR_DTXSTS_Msk          (0x1UL << ETH_MTLOMR_DTXSTS_Pos)            /*!< 0x00000002 */
#define ETH_MTLOMR_DTXSTS              ETH_MTLOMR_DTXSTS_Msk                       /*!< Drop Transmit Status */
#define ETH_MTLOMR_CNTPRST_Pos         (8U)
#define ETH_MTLOMR_CNTPRST_Msk         (0x1UL << ETH_MTLOMR_CNTPRST_Pos)           /*!< 0x00000100 */
#define ETH_MTLOMR_CNTPRST             ETH_MTLOMR_CNTPRST_Msk                      /*!< Counters Preset */
#define ETH_MTLOMR_CNTCLR_Pos          (9U)
#define ETH_MTLOMR_CNTCLR_Msk          (0x1UL << ETH_MTLOMR_CNTCLR_Pos)            /*!< 0x00000200 */
#define ETH_MTLOMR_CNTCLR              ETH_MTLOMR_CNTCLR_Msk                       /*!< Counters Reset */

/* ************************************  Bit definition for ETH_MTLISR register  ************************************ */
#define ETH_MTLISR_Q0IS_Pos            (0U)
#define ETH_MTLISR_Q0IS_Msk            (0x1UL << ETH_MTLISR_Q0IS_Pos)              /*!< 0x00000001 */
#define ETH_MTLISR_Q0IS                ETH_MTLISR_Q0IS_Msk                         /*!< Queue interrupt status */

/* **********************************  Bit definition for ETH_MTLTXQOMR register  *********************************** */
#define ETH_MTLTXQOMR_FTQ_Pos          (0U)
#define ETH_MTLTXQOMR_FTQ_Msk          (0x1UL << ETH_MTLTXQOMR_FTQ_Pos)            /*!< 0x00000001 */
#define ETH_MTLTXQOMR_FTQ              ETH_MTLTXQOMR_FTQ_Msk                       /*!< Flush Transmit Queue */
#define ETH_MTLTXQOMR_TSF_Pos          (1U)
#define ETH_MTLTXQOMR_TSF_Msk          (0x1UL << ETH_MTLTXQOMR_TSF_Pos)            /*!< 0x00000002 */
#define ETH_MTLTXQOMR_TSF              ETH_MTLTXQOMR_TSF_Msk                       /*!< Transmit Store and Forward */
#define ETH_MTLTXQOMR_TXQEN_Pos        (2U)
#define ETH_MTLTXQOMR_TXQEN_Msk        (0x3UL << ETH_MTLTXQOMR_TXQEN_Pos)          /*!< 0x0000000C */
#define ETH_MTLTXQOMR_TXQEN            ETH_MTLTXQOMR_TXQEN_Msk                     /*!< Transmit Queue Enable */
#define ETH_MTLTXQOMR_TTC_Pos          (4U)
#define ETH_MTLTXQOMR_TTC_Msk          (0x7UL << ETH_MTLTXQOMR_TTC_Pos)            /*!< 0x00000070 */
#define ETH_MTLTXQOMR_TTC              ETH_MTLTXQOMR_TTC_Msk                       /*!< Transmit Threshold Control */
#define ETH_MTLTXQOMR_TQS_Pos          (16U)
#define ETH_MTLTXQOMR_TQS_Msk          (0x7UL << ETH_MTLTXQOMR_TQS_Pos)            /*!< 0x00070000 */
#define ETH_MTLTXQOMR_TQS              ETH_MTLTXQOMR_TQS_Msk                       /*!< Transmit queue size */

/* ***********************************  Bit definition for ETH_MTLTXQUR register  *********************************** */
#define ETH_MTLTXQUR_UFFRMCNT_Pos      (0U)
#define ETH_MTLTXQUR_UFFRMCNT_Msk      (0x7FFUL << ETH_MTLTXQUR_UFFRMCNT_Pos)      /*!< 0x000007FF */
#define ETH_MTLTXQUR_UFFRMCNT          ETH_MTLTXQUR_UFFRMCNT_Msk                   /*!< Underflow Packet Counter */
#define ETH_MTLTXQUR_UFCNTOVF_Pos      (11U)
#define ETH_MTLTXQUR_UFCNTOVF_Msk      (0x1UL << ETH_MTLTXQUR_UFCNTOVF_Pos)        /*!< 0x00000800 */
#define ETH_MTLTXQUR_UFCNTOVF          ETH_MTLTXQUR_UFCNTOVF_Msk                   /*!< Overflow Bit for Underflow
                                                                                        Packet Counter */

/* ***********************************  Bit definition for ETH_MTLTXQDR register  *********************************** */
#define ETH_MTLTXQDR_TXQPAUSED_Pos     (0U)
#define ETH_MTLTXQDR_TXQPAUSED_Msk     (0x1UL << ETH_MTLTXQDR_TXQPAUSED_Pos)       /*!< 0x00000001 */
#define ETH_MTLTXQDR_TXQPAUSED         ETH_MTLTXQDR_TXQPAUSED_Msk                  /*!< Transmit Queue in Pause */
#define ETH_MTLTXQDR_TRCSTS_Pos        (1U)
#define ETH_MTLTXQDR_TRCSTS_Msk        (0x3UL << ETH_MTLTXQDR_TRCSTS_Pos)          /*!< 0x00000006 */
#define ETH_MTLTXQDR_TRCSTS            ETH_MTLTXQDR_TRCSTS_Msk                     /*!< MTL Tx Queue Read Controller
                                                                                        Status */
#define ETH_MTLTXQDR_TWCSTS_Pos        (3U)
#define ETH_MTLTXQDR_TWCSTS_Msk        (0x1UL << ETH_MTLTXQDR_TWCSTS_Pos)          /*!< 0x00000008 */
#define ETH_MTLTXQDR_TWCSTS            ETH_MTLTXQDR_TWCSTS_Msk                     /*!< MTL Tx Queue Write Controller
                                                                                        Status */
#define ETH_MTLTXQDR_TXQSTS_Pos        (4U)
#define ETH_MTLTXQDR_TXQSTS_Msk        (0x1UL << ETH_MTLTXQDR_TXQSTS_Pos)          /*!< 0x00000010 */
#define ETH_MTLTXQDR_TXQSTS            ETH_MTLTXQDR_TXQSTS_Msk                     /*!< MTL Tx Queue Not Empty Status */
#define ETH_MTLTXQDR_TXSTSFSTS_Pos     (5U)
#define ETH_MTLTXQDR_TXSTSFSTS_Msk     (0x1UL << ETH_MTLTXQDR_TXSTSFSTS_Pos)       /*!< 0x00000020 */
#define ETH_MTLTXQDR_TXSTSFSTS         ETH_MTLTXQDR_TXSTSFSTS_Msk                  /*!< MTL Tx Status FIFO Full Status
                                                                                        */
#define ETH_MTLTXQDR_PTXQ_Pos          (16U)
#define ETH_MTLTXQDR_PTXQ_Msk          (0x7UL << ETH_MTLTXQDR_PTXQ_Pos)            /*!< 0x00070000 */
#define ETH_MTLTXQDR_PTXQ              ETH_MTLTXQDR_PTXQ_Msk                       /*!< Number of Packets in the
                                                                                        Transmit Queue */
#define ETH_MTLTXQDR_STXSTSF_Pos       (20U)
#define ETH_MTLTXQDR_STXSTSF_Msk       (0x7UL << ETH_MTLTXQDR_STXSTSF_Pos)         /*!< 0x00700000 */
#define ETH_MTLTXQDR_STXSTSF           ETH_MTLTXQDR_STXSTSF_Msk                    /*!< Number of Status Words in Tx
                                                                                        Status FIFO of Queue */

/* ***********************************  Bit definition for ETH_MTLQICSR register  *********************************** */
#define ETH_MTLQICSR_TXUNFIS_Pos       (0U)
#define ETH_MTLQICSR_TXUNFIS_Msk       (0x1UL << ETH_MTLQICSR_TXUNFIS_Pos)         /*!< 0x00000001 */
#define ETH_MTLQICSR_TXUNFIS           ETH_MTLQICSR_TXUNFIS_Msk                    /*!< Transmit Queue Underflow
                                                                                        Interrupt Status */
#define ETH_MTLQICSR_TXUIE_Pos         (8U)
#define ETH_MTLQICSR_TXUIE_Msk         (0x1UL << ETH_MTLQICSR_TXUIE_Pos)           /*!< 0x00000100 */
#define ETH_MTLQICSR_TXUIE             ETH_MTLQICSR_TXUIE_Msk                      /*!< Transmit Queue Underflow
                                                                                        Interrupt Enable */
#define ETH_MTLQICSR_RXOVFIS_Pos       (16U)
#define ETH_MTLQICSR_RXOVFIS_Msk       (0x1UL << ETH_MTLQICSR_RXOVFIS_Pos)         /*!< 0x00010000 */
#define ETH_MTLQICSR_RXOVFIS           ETH_MTLQICSR_RXOVFIS_Msk                    /*!< Receive Queue Overflow Interrupt
                                                                                        Status */
#define ETH_MTLQICSR_RXOIE_Pos         (24U)
#define ETH_MTLQICSR_RXOIE_Msk         (0x1UL << ETH_MTLQICSR_RXOIE_Pos)           /*!< 0x01000000 */
#define ETH_MTLQICSR_RXOIE             ETH_MTLQICSR_RXOIE_Msk                      /*!< Receive Queue Overflow Interrupt
                                                                                        Enable */

