MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* ************************************  Bit definition for EXTI_EMR1 register  ************************************* */
#define EXTI_EMR1_EM0_Pos         (0U)
#define EXTI_EMR1_EM0_Msk         (0x1UL << EXTI_EMR1_EM0_Pos)           /*!< 0x00000001 */
#define EXTI_EMR1_EM0             EXTI_EMR1_EM0_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 0 */
#define EXTI_EMR1_EM1_Pos         (1U)
#define EXTI_EMR1_EM1_Msk         (0x1UL << EXTI_EMR1_EM1_Pos)           /*!< 0x00000002 */
#define EXTI_EMR1_EM1             EXTI_EMR1_EM1_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 1 */
#define EXTI_EMR1_EM2_Pos         (2U)
#define EXTI_EMR1_EM2_Msk         (0x1UL << EXTI_EMR1_EM2_Pos)           /*!< 0x00000004 */
#define EXTI_EMR1_EM2             EXTI_EMR1_EM2_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 2 */
#define EXTI_EMR1_EM3_Pos         (3U)
#define EXTI_EMR1_EM3_Msk         (0x1UL << EXTI_EMR1_EM3_Pos)           /*!< 0x00000008 */
#define EXTI_EMR1_EM3             EXTI_EMR1_EM3_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 3 */
#define EXTI_EMR1_EM4_Pos         (4U)
#define EXTI_EMR1_EM4_Msk         (0x1UL << EXTI_EMR1_EM4_Pos)           /*!< 0x00000010 */
#define EXTI_EMR1_EM4             EXTI_EMR1_EM4_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 4 */
#define EXTI_EMR1_EM5_Pos         (5U)
#define EXTI_EMR1_EM5_Msk         (0x1UL << EXTI_EMR1_EM5_Pos)           /*!< 0x00000020 */
#define EXTI_EMR1_EM5             EXTI_EMR1_EM5_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 5 */
#define EXTI_EMR1_EM6_Pos         (6U)
#define EXTI_EMR1_EM6_Msk         (0x1UL << EXTI_EMR1_EM6_Pos)           /*!< 0x00000040 */
#define EXTI_EMR1_EM6             EXTI_EMR1_EM6_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 6 */
#define EXTI_EMR1_EM7_Pos         (7U)
#define EXTI_EMR1_EM7_Msk         (0x1UL << EXTI_EMR1_EM7_Pos)           /*!< 0x00000080 */
#define EXTI_EMR1_EM7             EXTI_EMR1_EM7_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 7 */
#define EXTI_EMR1_EM8_Pos         (8U)
#define EXTI_EMR1_EM8_Msk         (0x1UL << EXTI_EMR1_EM8_Pos)           /*!< 0x00000100 */
#define EXTI_EMR1_EM8             EXTI_EMR1_EM8_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 8 */
#define EXTI_EMR1_EM9_Pos         (9U)
#define EXTI_EMR1_EM9_Msk         (0x1UL << EXTI_EMR1_EM9_Pos)           /*!< 0x00000200 */
#define EXTI_EMR1_EM9             EXTI_EMR1_EM9_Msk                      /*!< CPU wake-up with event generation mask on
                                                                              event input 9 */
#define EXTI_EMR1_EM10_Pos        (10U)
#define EXTI_EMR1_EM10_Msk        (0x1UL << EXTI_EMR1_EM10_Pos)          /*!< 0x00000400 */
#define EXTI_EMR1_EM10            EXTI_EMR1_EM10_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 10 */
#define EXTI_EMR1_EM11_Pos        (11U)
#define EXTI_EMR1_EM11_Msk        (0x1UL << EXTI_EMR1_EM11_Pos)          /*!< 0x00000800 */
#define EXTI_EMR1_EM11            EXTI_EMR1_EM11_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 11 */
#define EXTI_EMR1_EM12_Pos        (12U)
#define EXTI_EMR1_EM12_Msk        (0x1UL << EXTI_EMR1_EM12_Pos)          /*!< 0x00001000 */
#define EXTI_EMR1_EM12            EXTI_EMR1_EM12_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 12 */
#define EXTI_EMR1_EM13_Pos        (13U)
#define EXTI_EMR1_EM13_Msk        (0x1UL << EXTI_EMR1_EM13_Pos)          /*!< 0x00002000 */
#define EXTI_EMR1_EM13            EXTI_EMR1_EM13_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 13 */
#define EXTI_EMR1_EM14_Pos        (14U)
#define EXTI_EMR1_EM14_Msk        (0x1UL << EXTI_EMR1_EM14_Pos)          /*!< 0x00004000 */
#define EXTI_EMR1_EM14            EXTI_EMR1_EM14_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 14 */
#define EXTI_EMR1_EM15_Pos        (15U)
#define EXTI_EMR1_EM15_Msk        (0x1UL << EXTI_EMR1_EM15_Pos)          /*!< 0x00008000 */
#define EXTI_EMR1_EM15            EXTI_EMR1_EM15_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 15 */
#define EXTI_EMR1_EM16_Pos        (16U)
#define EXTI_EMR1_EM16_Msk        (0x1UL << EXTI_EMR1_EM16_Pos)          /*!< 0x00010000 */
#define EXTI_EMR1_EM16            EXTI_EMR1_EM16_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 16 */
#define EXTI_EMR1_EM17_Pos        (17U)
#define EXTI_EMR1_EM17_Msk        (0x1UL << EXTI_EMR1_EM17_Pos)          /*!< 0x00020000 */
#define EXTI_EMR1_EM17            EXTI_EMR1_EM17_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 17 */
#define EXTI_EMR1_EM18_Pos        (18U)
#define EXTI_EMR1_EM18_Msk        (0x1UL << EXTI_EMR1_EM18_Pos)          /*!< 0x00040000 */
#define EXTI_EMR1_EM18            EXTI_EMR1_EM18_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 18 */
#define EXTI_EMR1_EM19_Pos        (19U)
#define EXTI_EMR1_EM19_Msk        (0x1UL << EXTI_EMR1_EM19_Pos)          /*!< 0x00080000 */
#define EXTI_EMR1_EM19            EXTI_EMR1_EM19_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 19 */
#define EXTI_EMR1_EM20_Pos        (20U)
#define EXTI_EMR1_EM20_Msk        (0x1UL << EXTI_EMR1_EM20_Pos)          /*!< 0x00100000 */
#define EXTI_EMR1_EM20            EXTI_EMR1_EM20_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 20 */
#define EXTI_EMR1_EM21_Pos        (21U)
#define EXTI_EMR1_EM21_Msk        (0x1UL << EXTI_EMR1_EM21_Pos)          /*!< 0x00200000 */
#define EXTI_EMR1_EM21            EXTI_EMR1_EM21_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 21 */
#define EXTI_EMR1_EM22_Pos        (22U)
#define EXTI_EMR1_EM22_Msk        (0x1UL << EXTI_EMR1_EM22_Pos)          /*!< 0x00400000 */
#define EXTI_EMR1_EM22            EXTI_EMR1_EM22_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 22 */
#define EXTI_EMR1_EM23_Pos        (23U)
#define EXTI_EMR1_EM23_Msk        (0x1UL << EXTI_EMR1_EM23_Pos)          /*!< 0x00800000 */
#define EXTI_EMR1_EM23            EXTI_EMR1_EM23_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 23 */
#define EXTI_EMR1_EM24_Pos        (24U)
#define EXTI_EMR1_EM24_Msk        (0x1UL << EXTI_EMR1_EM24_Pos)          /*!< 0x01000000 */
#define EXTI_EMR1_EM24            EXTI_EMR1_EM24_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 24 */
#define EXTI_EMR1_EM25_Pos        (25U)
#define EXTI_EMR1_EM25_Msk        (0x1UL << EXTI_EMR1_EM25_Pos)          /*!< 0x02000000 */
#define EXTI_EMR1_EM25            EXTI_EMR1_EM25_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 25 */
#define EXTI_EMR1_EM26_Pos        (26U)
#define EXTI_EMR1_EM26_Msk        (0x1UL << EXTI_EMR1_EM26_Pos)          /*!< 0x04000000 */
#define EXTI_EMR1_EM26            EXTI_EMR1_EM26_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 26 */
#define EXTI_EMR1_EM27_Pos        (27U)
#define EXTI_EMR1_EM27_Msk        (0x1UL << EXTI_EMR1_EM27_Pos)          /*!< 0x08000000 */
#define EXTI_EMR1_EM27            EXTI_EMR1_EM27_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 27 */
#define EXTI_EMR1_EM28_Pos        (28U)
#define EXTI_EMR1_EM28_Msk        (0x1UL << EXTI_EMR1_EM28_Pos)          /*!< 0x10000000 */
#define EXTI_EMR1_EM28            EXTI_EMR1_EM28_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 28 */
#define EXTI_EMR1_EM29_Pos        (29U)
#define EXTI_EMR1_EM29_Msk        (0x1UL << EXTI_EMR1_EM29_Pos)          /*!< 0x20000000 */
#define EXTI_EMR1_EM29            EXTI_EMR1_EM29_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 29 */
#define EXTI_EMR1_EM30_Pos        (30U)
#define EXTI_EMR1_EM30_Msk        (0x1UL << EXTI_EMR1_EM30_Pos)          /*!< 0x40000000 */
#define EXTI_EMR1_EM30            EXTI_EMR1_EM30_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 30 */
#define EXTI_EMR1_EM31_Pos        (31U)
#define EXTI_EMR1_EM31_Msk        (0x1UL << EXTI_EMR1_EM31_Pos)          /*!< 0x80000000 */
#define EXTI_EMR1_EM31            EXTI_EMR1_EM31_Msk                     /*!< CPU wake-up with event generation mask on
                                                                              event input 31 */

/* ************************************  Bit definition for EXTI_IMR2 register  ************************************* */
#define EXTI_IMR2_IM32_Pos        (0U)
#define EXTI_IMR2_IM32_Msk        (0x1UL << EXTI_IMR2_IM32_Pos)           /*!< 0x00000001 */
#define EXTI_IMR2_IM32            EXTI_IMR2_IM32_Msk                      /*!< CPU wake-up with interrupt mask on event
                                                                               input 32 */
#define EXTI_IMR2_IM33_Pos        (1U)
#define EXTI_IMR2_IM33_Msk        (0x1UL << EXTI_IMR2_IM33_Pos)          /*!< 0x00000002 */
#define EXTI_IMR2_IM33            EXTI_IMR2_IM33_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 33*/
#define EXTI_IMR2_IM34_Pos        (2U)
#define EXTI_IMR2_IM34_Msk        (0x1UL << EXTI_IMR2_IM34_Pos)          /*!< 0x00000004 */
#define EXTI_IMR2_IM34            EXTI_IMR2_IM34_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 34 */
#define EXTI_IMR2_IM35_Pos        (3U)
#define EXTI_IMR2_IM35_Msk        (0x1UL << EXTI_IMR2_IM35_Pos)          /*!< 0x00000008 */
#define EXTI_IMR2_IM35            EXTI_IMR2_IM35_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 35 */
#define EXTI_IMR2_IM37_Pos        (5U)
#define EXTI_IMR2_IM37_Msk        (0x1UL << EXTI_IMR2_IM37_Pos)          /*!< 0x00000020 */
#define EXTI_IMR2_IM37            EXTI_IMR2_IM37_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 37 */
#define EXTI_IMR2_IM38_Pos        (6U)
#define EXTI_IMR2_IM38_Msk        (0x1UL << EXTI_IMR2_IM38_Pos)          /*!< 0x00000040 */
#define EXTI_IMR2_IM38            EXTI_IMR2_IM38_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 38 */
#define EXTI_IMR2_IM39_Pos        (7U)
#define EXTI_IMR2_IM39_Msk        (0x1UL << EXTI_IMR2_IM39_Pos)          /*!< 0x00000080 */
#define EXTI_IMR2_IM39            EXTI_IMR2_IM39_Msk                     /*!< CPU wake-up with interrupt mask on event
                                                                              input 39 */

