MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/********************  Bit definition for TIM_CNT register  ********************/
/*!< CNT configuration */
#define TIM_CNT_CNT_Pos    (0U)
#define TIM_CNT_CNT_Msk    (0x7FFFFFFFUL << TIM_CNT_CNT_Pos) /*!< 0x7FFFFFFF */
#define TIM_CNT_CNT        TIM_CNT_CNT_Msk                   /*!< CNT[30:0] bits (Counter value) */
/*!< UIFCPY configuration */
#define TIM_CNT_UIFCPY_Pos (31U)
#define TIM_CNT_UIFCPY_Msk (0x1UL << TIM_CNT_UIFCPY_Pos)     /*!< 0x80000000 */
#define TIM_CNT_UIFCPY     TIM_CNT_UIFCPY_Msk                /*!< UIFCPY (UIF copy) */

/********************  Bit definition for TIM_PSC register  ********************/
/*!< PSC configuration */
#define TIM_PSC_PSC_Pos (0U)
#define TIM_PSC_PSC_Msk (0xFFFFUL << TIM_PSC_PSC_Pos) /*!< 0x0000FFFF */
#define TIM_PSC_PSC     TIM_PSC_PSC_Msk               /*!< PSC[15:0] bits (Prescaler value) */

/********************  Bit definition for TIM_ARR register  ********************/
/*!< ARR configuration */
#define TIM_ARR_ARR_Pos (0U)
#define TIM_ARR_ARR_Msk (0xFFFFFFFFUL << TIM_ARR_ARR_Pos) /*!< 0xFFFFFFFF */
#define TIM_ARR_ARR     TIM_ARR_ARR_Msk                   /*!< ARR[31:0] bits (Auto-reload value) */

/********************  Bit definition for TIM_RCR register  ********************/
/*!< REP configuration */
#define TIM_RCR_REP_Pos (0U)
#define TIM_RCR_REP_Msk (0xFFFFUL << TIM_RCR_REP_Pos) /*!< 0x0000FFFF */
#define TIM_RCR_REP     TIM_RCR_REP_Msk               /*!< REP[15:0] bits (Repetition counter reload value) */

/********************  Bit definition for TIM_CCR1 register  ********************/
/*!< CCR1 configuration */
#define TIM_CCR1_CCR1_Pos (0U)
#define TIM_CCR1_CCR1_Msk (0xFFFFFFFFUL << TIM_CCR1_CCR1_Pos) /*!< 0xFFFFFFFF */
#define TIM_CCR1_CCR1     TIM_CCR1_CCR1_Msk                   /*!< CCR1[31:0] bits (Capture/compare 1 value) */

/********************  Bit definition for TIM_CCR2 register  ********************/
/*!< CCR2 configuration */
#define TIM_CCR2_CCR2_Pos (0U)
#define TIM_CCR2_CCR2_Msk (0xFFFFFFFFUL << TIM_CCR2_CCR2_Pos) /*!< 0xFFFFFFFF */
#define TIM_CCR2_CCR2     TIM_CCR2_CCR2_Msk                   /*!< CCR2[31:0] bits (Capture/compare 2 value) */

/********************  Bit definition for TIM_CCR3 register  ********************/
/*!< CCR3 configuration */
#define TIM_CCR3_CCR3_Pos (0U)
#define TIM_CCR3_CCR3_Msk (0xFFFFFFFFUL << TIM_CCR3_CCR3_Pos) /*!< 0xFFFFFFFF */
#define TIM_CCR3_CCR3     TIM_CCR3_CCR3_Msk                   /*!< CCR3[31:0] bits (Capture/compare 3 value) */

/********************  Bit definition for TIM_CCR4 register  ********************/
/*!< CCR4 configuration */
#define TIM_CCR4_CCR4_Pos (0U)
#define TIM_CCR4_CCR4_Msk (0xFFFFFFFFUL << TIM_CCR4_CCR4_Pos) /*!< 0xFFFFFFFF */
#define TIM_CCR4_CCR4     TIM_CCR4_CCR4_Msk                   /*!< CCR4[19:0] bits (Capture/compare 4 value) */

/********************  Bit definition for TIM_BDTR register  ********************/
/*!< DTG configuration */
#define TIM_BDTR_DTG_Pos     (0U)
#define TIM_BDTR_DTG_Msk     (0xFFUL << TIM_BDTR_DTG_Pos)    /*!< 0x000000FF */
#define TIM_BDTR_DTG         TIM_BDTR_DTG_Msk                /*!< DTG[7:0] bits (Dead-time generator setup) */
#define TIM_BDTR_DTG_0       (0x001UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000001 */
#define TIM_BDTR_DTG_1       (0x002UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000002 */
#define TIM_BDTR_DTG_2       (0x004UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000004 */
#define TIM_BDTR_DTG_3       (0x008UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000008 */
#define TIM_BDTR_DTG_4       (0x010UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000010 */
#define TIM_BDTR_DTG_5       (0x020UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000020 */
#define TIM_BDTR_DTG_6       (0x040UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000040 */
#define TIM_BDTR_DTG_7       (0x080UL << TIM_BDTR_DTG_Pos)   /*!< 0x00000080 */
/*!< LOCK configuration */
#define TIM_BDTR_LOCK_Pos    (8U)
#define TIM_BDTR_LOCK_Msk    (0x3UL << TIM_BDTR_LOCK_Pos)    /*!< 0x00000300 */
#define TIM_BDTR_LOCK        TIM_BDTR_LOCK_Msk               /*!< LOCK[1:0] bits (Lock configuration) */
#define TIM_BDTR_LOCK_0      (0x1UL << TIM_BDTR_LOCK_Pos)    /*!< 0x00000100 */
#define TIM_BDTR_LOCK_1      (0x2UL << TIM_BDTR_LOCK_Pos)    /*!< 0x00000200 */
/*!< OSSI configuration */
#define TIM_BDTR_OSSI_Pos    (10U)
#define TIM_BDTR_OSSI_Msk    (0x1UL << TIM_BDTR_OSSI_Pos)    /*!< 0x00000400 */
#define TIM_BDTR_OSSI        TIM_BDTR_OSSI_Msk               /*!< OSSI (Off-state selection for idle mode) */
/*!< OSSR configuration */
#define TIM_BDTR_OSSR_Pos    (11U)
#define TIM_BDTR_OSSR_Msk    (0x1UL << TIM_BDTR_OSSR_Pos)    /*!< 0x00000800 */
#define TIM_BDTR_OSSR        TIM_BDTR_OSSR_Msk               /*!< OSSR (Off-state selection for Run mode) */
/*!< BKE configuration */
#define TIM_BDTR_BKE_Pos     (12U)
#define TIM_BDTR_BKE_Msk     (0x1UL << TIM_BDTR_BKE_Pos)     /*!< 0x00001000 */
#define TIM_BDTR_BKE         TIM_BDTR_BKE_Msk                /*!< BKE (Break enable) */
/*!< BKP configuration */
#define TIM_BDTR_BKP_Pos     (13U)
#define TIM_BDTR_BKP_Msk     (0x1UL << TIM_BDTR_BKP_Pos)     /*!< 0x00002000 */
#define TIM_BDTR_BKP         TIM_BDTR_BKP_Msk                /*!< BKP (Break polarity) */
/*!< AOE configuration */
#define TIM_BDTR_AOE_Pos     (14U)
#define TIM_BDTR_AOE_Msk     (0x1UL << TIM_BDTR_AOE_Pos)     /*!< 0x00004000 */
#define TIM_BDTR_AOE         TIM_BDTR_AOE_Msk                /*!< AOE (Automatic output enable) */
/*!< MOE configuration */
#define TIM_BDTR_MOE_Pos     (15U)
#define TIM_BDTR_MOE_Msk     (0x1UL << TIM_BDTR_MOE_Pos)     /*!< 0x00008000 */
#define TIM_BDTR_MOE         TIM_BDTR_MOE_Msk                /*!< MOE (Main output enable) */
/*!< BKF configuration */
#define TIM_BDTR_BKF_Pos     (16U)
#define TIM_BDTR_BKF_Msk     (0xFUL << TIM_BDTR_BKF_Pos)     /*!< 0x000F0000 */
#define TIM_BDTR_BKF         TIM_BDTR_BKF_Msk                /*!< BKF[3:0] bits (Break filter) */
#define TIM_BDTR_BKF_0       (0x01UL << TIM_BDTR_BKF_Pos)    /*!< 0x00010000 */
#define TIM_BDTR_BKF_1       (0x02UL << TIM_BDTR_BKF_Pos)    /*!< 0x00020000 */
#define TIM_BDTR_BKF_2       (0x04UL << TIM_BDTR_BKF_Pos)    /*!< 0x00040000 */
#define TIM_BDTR_BKF_3       (0x08UL << TIM_BDTR_BKF_Pos)    /*!< 0x00080000 */
/*!< BK2F configuration */
#define TIM_BDTR_BK2F_Pos    (20U)
#define TIM_BDTR_BK2F_Msk    (0xFUL << TIM_BDTR_BK2F_Pos)    /*!< 0x00F00000 */
#define TIM_BDTR_BK2F        TIM_BDTR_BK2F_Msk               /*!< BK2F[3:0] bits (Break 2 filter) */
#define TIM_BDTR_BK2F_0      (0x01UL << TIM_BDTR_BK2F_Pos)   /*!< 0x00100000 */
#define TIM_BDTR_BK2F_1      (0x02UL << TIM_BDTR_BK2F_Pos)   /*!< 0x00200000 */
#define TIM_BDTR_BK2F_2      (0x04UL << TIM_BDTR_BK2F_Pos)   /*!< 0x00400000 */
#define TIM_BDTR_BK2F_3      (0x08UL << TIM_BDTR_BK2F_Pos)   /*!< 0x00800000 */
/*!< BK2E configuration */
#define TIM_BDTR_BK2E_Pos    (24U)
#define TIM_BDTR_BK2E_Msk    (0x1UL << TIM_BDTR_BK2E_Pos)    /*!< 0x01000000 */
#define TIM_BDTR_BK2E        TIM_BDTR_BK2E_Msk               /*!< BK2E (Break 2 enable) */
/*!< BK2P configuration */
#define TIM_BDTR_BK2P_Pos    (25U)
#define TIM_BDTR_BK2P_Msk    (0x1UL << TIM_BDTR_BK2P_Pos)    /*!< 0x02000000 */
#define TIM_BDTR_BK2P        TIM_BDTR_BK2P_Msk               /*!< BK2P (Break 2 polarity) */
/*!< BKDSRM configuration */
#define TIM_BDTR_BKDSRM_Pos  (26U)
#define TIM_BDTR_BKDSRM_Msk  (0x1UL << TIM_BDTR_BKDSRM_Pos)  /*!< 0x04000000 */
#define TIM_BDTR_BKDSRM      TIM_BDTR_BKDSRM_Msk             /*!< BKDSRM (Break disarm) */
/*!< BK2DSRM configuration */
#define TIM_BDTR_BK2DSRM_Pos (27U)
#define TIM_BDTR_BK2DSRM_Msk (0x1UL << TIM_BDTR_BK2DSRM_Pos) /*!< 0x08000000 */
#define TIM_BDTR_BK2DSRM     TIM_BDTR_BK2DSRM_Msk            /*!< BK2DSRM (Break2 disarm) */
/*!< BKBID configuration */
#define TIM_BDTR_BKBID_Pos   (28U)
#define TIM_BDTR_BKBID_Msk   (0x1UL << TIM_BDTR_BKBID_Pos)   /*!< 0x10000000 */
#define TIM_BDTR_BKBID       TIM_BDTR_BKBID_Msk              /*!< BKBID (Break bidirectional) */
/*!< BK2BID configuration */
#define TIM_BDTR_BK2BID_Pos  (29U)
#define TIM_BDTR_BK2BID_Msk  (0x1UL << TIM_BDTR_BK2BID_Pos)  /*!< 0x20000000 */
#define TIM_BDTR_BK2BID      TIM_BDTR_BK2BID_Msk             /*!< BK2BID (Break2 bidirectional) */

