MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/*******************  Bit definition for USART_ICR register  ******************/
#define USART_ICR_PECF_Pos                  (0U)
#define USART_ICR_PECF_Msk                  (0x1UL << USART_ICR_PECF_Pos)           /*!< 0x00000001 */
#define USART_ICR_PECF                      USART_ICR_PECF_Msk                      /*!< Parity Error Clear Flag */
#define USART_ICR_FECF_Pos                  (1U)
#define USART_ICR_FECF_Msk                  (0x1UL << USART_ICR_FECF_Pos)           /*!< 0x00000002 */
#define USART_ICR_FECF                      USART_ICR_FECF_Msk                      /*!< Framing Error Clear Flag */
#define USART_ICR_NECF_Pos                  (2U)
#define USART_ICR_NECF_Msk                  (0x1UL << USART_ICR_NECF_Pos)           /*!< 0x00000004 */
#define USART_ICR_NECF                      USART_ICR_NECF_Msk                      /*!< Noise Error detected Clear Flag */
#define USART_ICR_ORECF_Pos                 (3U)
#define USART_ICR_ORECF_Msk                 (0x1UL << USART_ICR_ORECF_Pos)          /*!< 0x00000008 */
#define USART_ICR_ORECF                     USART_ICR_ORECF_Msk                     /*!< OverRun Error Clear Flag */
#define USART_ICR_IDLECF_Pos                (4U)
#define USART_ICR_IDLECF_Msk                (0x1UL << USART_ICR_IDLECF_Pos)         /*!< 0x00000010 */
#define USART_ICR_IDLECF                    USART_ICR_IDLECF_Msk                    /*!< IDLE line detected Clear Flag */
#define USART_ICR_TXFECF_Pos                (5U)
#define USART_ICR_TXFECF_Msk                (0x1UL << USART_ICR_TXFECF_Pos)         /*!< 0x00000020 */
#define USART_ICR_TXFECF                    USART_ICR_TXFECF_Msk                    /*!< TX FIFO Empty Clear Flag */
#define USART_ICR_TCCF_Pos                  (6U)
#define USART_ICR_TCCF_Msk                  (0x1UL << USART_ICR_TCCF_Pos)           /*!< 0x00000040 */
#define USART_ICR_TCCF                      USART_ICR_TCCF_Msk                      /*!< Transmission Complete Clear Flag */
#define USART_ICR_TCBGTCF_Pos               (7U)
#define USART_ICR_TCBGTCF_Msk               (0x1UL << USART_ICR_TCBGTCF_Pos)        /*!< 0x00000080 */
#define USART_ICR_TCBGTCF                   USART_ICR_TCBGTCF_Msk                   /*!< Transmission Complete Before Guard Time Clear Flag */
#define USART_ICR_LBDCF_Pos                 (8U)
#define USART_ICR_LBDCF_Msk                 (0x1UL << USART_ICR_LBDCF_Pos)          /*!< 0x00000100 */
#define USART_ICR_LBDCF                     USART_ICR_LBDCF_Msk                     /*!< LIN Break Detection Clear Flag */
#define USART_ICR_CTSCF_Pos                 (9U)
#define USART_ICR_CTSCF_Msk                 (0x1UL << USART_ICR_CTSCF_Pos)          /*!< 0x00000200 */
#define USART_ICR_CTSCF                     USART_ICR_CTSCF_Msk                     /*!< CTS Interrupt Clear Flag */
#define USART_ICR_RTOCF_Pos                 (11U)
#define USART_ICR_RTOCF_Msk                 (0x1UL << USART_ICR_RTOCF_Pos)          /*!< 0x00000800 */
#define USART_ICR_RTOCF                     USART_ICR_RTOCF_Msk                     /*!< Receiver Time Out Clear Flag */
#define USART_ICR_EOBCF_Pos                 (12U)
#define USART_ICR_EOBCF_Msk                 (0x1UL << USART_ICR_EOBCF_Pos)          /*!< 0x00001000 */
#define USART_ICR_EOBCF                     USART_ICR_EOBCF_Msk                     /*!< End Of Block Clear Flag */
#define USART_ICR_UDRCF_Pos                 (13U)
#define USART_ICR_UDRCF_Msk                 (0x1UL << USART_ICR_UDRCF_Pos)          /*!< 0x00002000 */
#define USART_ICR_UDRCF                     USART_ICR_UDRCF_Msk                     /*!< SPI Slave Underrun Clear Flag */
#define USART_ICR_CMCF_Pos                  (17U)
#define USART_ICR_CMCF_Msk                  (0x1UL << USART_ICR_CMCF_Pos)           /*!< 0x00020000 */
#define USART_ICR_CMCF                      USART_ICR_CMCF_Msk                      /*!< Character Match Clear Flag */
#define USART_ICR_WUCF_Pos                  (20U)
#define USART_ICR_WUCF_Msk                  (0x1UL << USART_ICR_WUCF_Pos)           /*!< 0x00100000 */
#define USART_ICR_WUCF                      USART_ICR_WUCF_Msk                      /*!< Wake Up from stop mode Clear Flag */

/*******************  Bit definition for USART_RDR register  ******************/
#define USART_RDR_RDR                       ((uint16_t)0x01FF)                      /*!< RDR[8:0] bits (Receive Data value) */

/*******************  Bit definition for USART_TDR register  ******************/
#define USART_TDR_TDR                       ((uint16_t)0x01FF)                      /*!< TDR[8:0] bits (Transmit Data value) */

/*******************  Bit definition for USART_PRESC register  ****************/
#define USART_PRESC_PRESCALER_Pos           (0U)
#define USART_PRESC_PRESCALER_Msk           (0xFUL << USART_PRESC_PRESCALER_Pos)    /*!< 0x0000000F */
#define USART_PRESC_PRESCALER               USART_PRESC_PRESCALER_Msk               /*!< PRESCALER[3:0] bits (Clock prescaler) */
#define USART_PRESC_PRESCALER_0             (0x1UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000001 */
#define USART_PRESC_PRESCALER_1             (0x2UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000002 */
#define USART_PRESC_PRESCALER_2             (0x4UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000004 */
#define USART_PRESC_PRESCALER_3             (0x8UL << USART_PRESC_PRESCALER_Pos)    /*!< 0x00000008 */

/* ****************************************************************************************************************** */
/*                                                                                                                    */
/*                            Universal serial bus full-speed host/device interface (USB)                             */
/*                                                                                                                    */
/* ****************************************************************************************************************** */

/* *************************************  Bit definition for USB_CHEP register  ************************************* */
#define USB_CHEP_EA_Pos           (0U)
#define USB_CHEP_EA_Msk           (0xFUL << USB_CHEP_EA_Pos)             /*!< 0x0000000F */
#define USB_CHEP_EA               USB_CHEP_EA_Msk                        /*!< endpoint/channel address */
#define USB_CHEP_STATTX_Pos       (4U)
#define USB_CHEP_STATTX_Msk       (0x3UL << USB_CHEP_STATTX_Pos)         /*!< 0x00000030 */
#define USB_CHEP_STATTX           USB_CHEP_STATTX_Msk                    /*!< Status bits, for transmission transfers */
#define USB_CHEP_DTOGTX_Pos       (6U)
#define USB_CHEP_DTOGTX_Msk       (0x1UL << USB_CHEP_DTOGTX_Pos)         /*!< 0x00000040 */
#define USB_CHEP_DTOGTX           USB_CHEP_DTOGTX_Msk                    /*!< Data toggle, for transmission transfers */
#define USB_CHEP_VTTX_Pos         (7U)
#define USB_CHEP_VTTX_Msk         (0x1UL << USB_CHEP_VTTX_Pos)           /*!< 0x00000080 */
#define USB_CHEP_VTTX             USB_CHEP_VTTX_Msk                      /*!< Valid USB transaction transmitted */
#define USB_CHEP_EPKIND_Pos       (8U)
#define USB_CHEP_EPKIND_Msk       (0x1UL << USB_CHEP_EPKIND_Pos)         /*!< 0x00000100 */
#define USB_CHEP_EPKIND           USB_CHEP_EPKIND_Msk                    /*!< endpoint/channel kind */
#define USB_CHEP_UTYPE_Pos        (9U)
#define USB_CHEP_UTYPE_Msk        (0x3UL << USB_CHEP_UTYPE_Pos)          /*!< 0x00000600 */
#define USB_CHEP_UTYPE            USB_CHEP_UTYPE_Msk                     /*!< USB type of transaction */
#define USB_CHEP_SETUP_Pos        (11U)
#define USB_CHEP_SETUP_Msk        (0x1UL << USB_CHEP_SETUP_Pos)          /*!< 0x00000800 */
#define USB_CHEP_SETUP            USB_CHEP_SETUP_Msk                     /*!< Setup transaction completed */
#define USB_CHEP_STATRX_Pos       (12U)
#define USB_CHEP_STATRX_Msk       (0x3UL << USB_CHEP_STATRX_Pos)         /*!< 0x00003000 */
#define USB_CHEP_STATRX           USB_CHEP_STATRX_Msk                    /*!< Status bits, for reception transfers */
#define USB_CHEP_DTOGRX_Pos       (14U)
#define USB_CHEP_DTOGRX_Msk       (0x1UL << USB_CHEP_DTOGRX_Pos)         /*!< 0x00004000 */
#define USB_CHEP_DTOGRX           USB_CHEP_DTOGRX_Msk                    /*!< Data Toggle, for reception transfers */
#define USB_CHEP_VTRX_Pos         (15U)
#define USB_CHEP_VTRX_Msk         (0x1UL << USB_CHEP_VTRX_Pos)           /*!< 0x00008000 */
#define USB_CHEP_VTRX             USB_CHEP_VTRX_Msk                      /*!< USB valid transaction received */
#define USB_CHEP_DEVADDR_Pos      (16U)
#define USB_CHEP_DEVADDR_Msk      (0x7FUL << USB_CHEP_DEVADDR_Pos)       /*!< 0x007F0000 */
#define USB_CHEP_DEVADDR          USB_CHEP_DEVADDR_Msk                   /*!< Host mode */
#define USB_CHEP_NAK_Pos          (23U)
#define USB_CHEP_NAK_Msk          (0x1UL << USB_CHEP_NAK_Pos)            /*!< 0x00800000 */
#define USB_CHEP_NAK              USB_CHEP_NAK_Msk                       /*!< Host mode */
#define USB_CHEP_LS_EP_Pos        (24U)
#define USB_CHEP_LS_EP_Msk        (0x1UL << USB_CHEP_LS_EP_Pos)          /*!< 0x01000000 */
#define USB_CHEP_LS_EP            USB_CHEP_LS_EP_Msk                     /*!< Low speed endpoint host with HUB only */
#define USB_CHEP_ERR_TX_Pos       (25U)
#define USB_CHEP_ERR_TX_Msk       (0x1UL << USB_CHEP_ERR_TX_Pos)         /*!< 0x02000000 */
#define USB_CHEP_ERR_TX           USB_CHEP_ERR_TX_Msk                    /*!< Received error for an OUT/SETUP
                                                                              transaction */
#define USB_CHEP_ERR_RX_Pos       (26U)
#define USB_CHEP_ERR_RX_Msk       (0x1UL << USB_CHEP_ERR_RX_Pos)         /*!< 0x04000000 */
#define USB_CHEP_ERR_RX           USB_CHEP_ERR_RX_Msk                    /*!< Received error for an IN transaction */
#define USB_CHEP_THREE_ERR_TX_Pos (27U)
#define USB_CHEP_THREE_ERR_TX_Msk (0x3UL << USB_CHEP_THREE_ERR_TX_Pos)   /*!< 0x18000000 */
#define USB_CHEP_THREE_ERR_TX     USB_CHEP_THREE_ERR_TX_Msk              /*!< Three errors for an OUT or SETUP
                                                                              transaction */
#define USB_CHEP_THREE_ERR_RX_Pos (29U)
#define USB_CHEP_THREE_ERR_RX_Msk (0x3UL << USB_CHEP_THREE_ERR_RX_Pos)   /*!< 0x60000000 */
#define USB_CHEP_THREE_ERR_RX     USB_CHEP_THREE_ERR_RX_Msk              /*!< Three errors for an IN transaction */

/* *************************************  Bit definition for USB_CNTR register  ************************************* */
#define USB_CNTR_USBRST_Pos       (0U)
#define USB_CNTR_USBRST_Msk       (0x1UL << USB_CNTR_USBRST_Pos)         /*!< 0x00000001 */
#define USB_CNTR_USBRST           USB_CNTR_USBRST_Msk                    /*!< USB Reset */
#define USB_CNTR_PDWN_Pos         (1U)
#define USB_CNTR_PDWN_Msk         (0x1UL << USB_CNTR_PDWN_Pos)           /*!< 0x00000002 */
#define USB_CNTR_PDWN             USB_CNTR_PDWN_Msk                      /*!< Power down */
#define USB_CNTR_SUSPRDY_Pos      (2U)
#define USB_CNTR_SUSPRDY_Msk      (0x1UL << USB_CNTR_SUSPRDY_Pos)        /*!< 0x00000004 */
#define USB_CNTR_SUSPRDY          USB_CNTR_SUSPRDY_Msk                   /*!< Suspend state effective */
#define USB_CNTR_SUSPEN_Pos       (3U)
#define USB_CNTR_SUSPEN_Msk       (0x1UL << USB_CNTR_SUSPEN_Pos)         /*!< 0x00000008 */
#define USB_CNTR_SUSPEN           USB_CNTR_SUSPEN_Msk                    /*!< Suspend state enable */
#define USB_CNTR_L2RES_Pos        (4U)
#define USB_CNTR_L2RES_Msk        (0x1UL << USB_CNTR_L2RES_Pos)          /*!< 0x00000010 */
#define USB_CNTR_L2RES            USB_CNTR_L2RES_Msk                     /*!< L2 remote wake-up / resume driver */
#define USB_CNTR_L1RES_Pos        (5U)
#define USB_CNTR_L1RES_Msk        (0x1UL << USB_CNTR_L1RES_Pos)          /*!< 0x00000020 */
#define USB_CNTR_L1RES            USB_CNTR_L1RES_Msk                     /*!< L1 remote wake-up / resume driver */
#define USB_CNTR_L1REQM_Pos       (7U)
#define USB_CNTR_L1REQM_Msk       (0x1UL << USB_CNTR_L1REQM_Pos)         /*!< 0x00000080 */
#define USB_CNTR_L1REQM           USB_CNTR_L1REQM_Msk                    /*!< LPM L1 state request interrupt mask */
#define USB_CNTR_ESOFM_Pos        (8U)
#define USB_CNTR_ESOFM_Msk        (0x1UL << USB_CNTR_ESOFM_Pos)          /*!< 0x00000100 */
#define USB_CNTR_ESOFM            USB_CNTR_ESOFM_Msk                     /*!< Expected start of frame interrupt mask */
#define USB_CNTR_SOFM_Pos         (9U)
#define USB_CNTR_SOFM_Msk         (0x1UL << USB_CNTR_SOFM_Pos)           /*!< 0x00000200 */
#define USB_CNTR_SOFM             USB_CNTR_SOFM_Msk                      /*!< Start of frame interrupt mask */
#define USB_CNTR_RST_DCONM_Pos    (10U)
#define USB_CNTR_RST_DCONM_Msk    (0x1UL << USB_CNTR_RST_DCONM_Pos)      /*!< 0x00000400 */
#define USB_CNTR_RST_DCONM        USB_CNTR_RST_DCONM_Msk                 /*!< USB reset request (Device mode) or device
                                                                              connect/disconnect (Host mode) interrupt
                                                                              mask */
#define USB_CNTR_SUSPM_Pos        (11U)
#define USB_CNTR_SUSPM_Msk        (0x1UL << USB_CNTR_SUSPM_Pos)          /*!< 0x00000800 */
#define USB_CNTR_SUSPM            USB_CNTR_SUSPM_Msk                     /*!< Suspend mode interrupt mask */
#define USB_CNTR_WKUPM_Pos        (12U)
#define USB_CNTR_WKUPM_Msk        (0x1UL << USB_CNTR_WKUPM_Pos)          /*!< 0x00001000 */
#define USB_CNTR_WKUPM            USB_CNTR_WKUPM_Msk                     /*!< Wake-up interrupt mask */
#define USB_CNTR_ERRM_Pos         (13U)
#define USB_CNTR_ERRM_Msk         (0x1UL << USB_CNTR_ERRM_Pos)           /*!< 0x00002000 */
#define USB_CNTR_ERRM             USB_CNTR_ERRM_Msk                      /*!< Error interrupt mask */
#define USB_CNTR_PMAOVRM_Pos      (14U)
#define USB_CNTR_PMAOVRM_Msk      (0x1UL << USB_CNTR_PMAOVRM_Pos)        /*!< 0x00004000 */
#define USB_CNTR_PMAOVRM          USB_CNTR_PMAOVRM_Msk                   /*!< Packet memory area over / underrun
                                                                              interrupt mask */
#define USB_CNTR_CTRM_Pos         (15U)
#define USB_CNTR_CTRM_Msk         (0x1UL << USB_CNTR_CTRM_Pos)           /*!< 0x00008000 */
#define USB_CNTR_CTRM             USB_CNTR_CTRM_Msk                      /*!< Correct transfer interrupt mask */
#define USB_CNTR_THR512M_Pos      (16U)
#define USB_CNTR_THR512M_Msk      (0x1UL << USB_CNTR_THR512M_Pos)        /*!< 0x00010000 */
#define USB_CNTR_THR512M          USB_CNTR_THR512M_Msk                   /*!< 512 byte threshold interrupt mask */
#define USB_CNTR_DDISCM_Pos       (17U)
#define USB_CNTR_DDISCM_Msk       (0x1UL << USB_CNTR_DDISCM_Pos)         /*!< 0x00020000 */
#define USB_CNTR_DDISCM           USB_CNTR_DDISCM_Msk                    /*!< Device disconnection mask */
#define USB_CNTR_HOST_Pos         (31U)
#define USB_CNTR_HOST_Msk         (0x1UL << USB_CNTR_HOST_Pos)           /*!< 0x80000000 */
#define USB_CNTR_HOST             USB_CNTR_HOST_Msk                      /*!< HOST mode */

/* *************************************  Bit definition for USB_ISTR register  ************************************* */
#define USB_ISTR_IDN_Pos          (0U)
#define USB_ISTR_IDN_Msk          (0xFUL << USB_ISTR_IDN_Pos)            /*!< 0x0000000F */
#define USB_ISTR_IDN              USB_ISTR_IDN_Msk                       /*!< Device Endpoint / host channel
                                                                              identification number */
#define USB_ISTR_DIR_Pos          (4U)
#define USB_ISTR_DIR_Msk          (0x1UL << USB_ISTR_DIR_Pos)            /*!< 0x00000010 */
#define USB_ISTR_DIR              USB_ISTR_DIR_Msk                       /*!< Direction of transaction */
#define USB_ISTR_L1REQ_Pos        (7U)
#define USB_ISTR_L1REQ_Msk        (0x1UL << USB_ISTR_L1REQ_Pos)          /*!< 0x00000080 */
#define USB_ISTR_L1REQ            USB_ISTR_L1REQ_Msk                     /*!< LPM L1 state request */
#define USB_ISTR_ESOF_Pos         (8U)
#define USB_ISTR_ESOF_Msk         (0x1UL << USB_ISTR_ESOF_Pos)           /*!< 0x00000100 */
#define USB_ISTR_ESOF             USB_ISTR_ESOF_Msk                      /*!< Expected start of frame */
#define USB_ISTR_SOF_Pos          (9U)
#define USB_ISTR_SOF_Msk          (0x1UL << USB_ISTR_SOF_Pos)            /*!< 0x00000200 */
#define USB_ISTR_SOF              USB_ISTR_SOF_Msk                       /*!< Start of frame */
#define USB_ISTR_RST_DCON_Pos     (10U)
#define USB_ISTR_RST_DCON_Msk     (0x1UL << USB_ISTR_RST_DCON_Pos)       /*!< 0x00000400 */
#define USB_ISTR_RST_DCON         USB_ISTR_RST_DCON_Msk                  /*!< USB reset request (Device mode) or device
                                                                              connect/disconnect (Host mode) */
#define USB_ISTR_SUSP_Pos         (11U)
#define USB_ISTR_SUSP_Msk         (0x1UL << USB_ISTR_SUSP_Pos)           /*!< 0x00000800 */
#define USB_ISTR_SUSP             USB_ISTR_SUSP_Msk                      /*!< Suspend mode request */
#define USB_ISTR_WKUP_Pos         (12U)
#define USB_ISTR_WKUP_Msk         (0x1UL << USB_ISTR_WKUP_Pos)           /*!< 0x00001000 */
#define USB_ISTR_WKUP             USB_ISTR_WKUP_Msk                      /*!< Wake-up */
#define USB_ISTR_ERR_Pos          (13U)
#define USB_ISTR_ERR_Msk          (0x1UL << USB_ISTR_ERR_Pos)            /*!< 0x00002000 */
#define USB_ISTR_ERR              USB_ISTR_ERR_Msk                       /*!< Error */
#define USB_ISTR_PMAOVR_Pos       (14U)
#define USB_ISTR_PMAOVR_Msk       (0x1UL << USB_ISTR_PMAOVR_Pos)         /*!< 0x00004000 */
#define USB_ISTR_PMAOVR           USB_ISTR_PMAOVR_Msk                    /*!< Packet memory area over / underrun */
#define USB_ISTR_CTR_Pos          (15U)
#define USB_ISTR_CTR_Msk          (0x1UL << USB_ISTR_CTR_Pos)            /*!< 0x00008000 */
#define USB_ISTR_CTR              USB_ISTR_CTR_Msk                       /*!< Completed transfer in host mode */
#define USB_ISTR_THR512_Pos       (16U)
#define USB_ISTR_THR512_Msk       (0x1UL << USB_ISTR_THR512_Pos)         /*!< 0x00010000 */
#define USB_ISTR_THR512           USB_ISTR_THR512_Msk                    /*!< 512 byte threshold interrupt */
#define USB_ISTR_DDISC_Pos        (17U)
#define USB_ISTR_DDISC_Msk        (0x1UL << USB_ISTR_DDISC_Pos)          /*!< 0x00020000 */
#define USB_ISTR_DDISC            USB_ISTR_DDISC_Msk                     /*!< Device connection */
#define USB_ISTR_DCON_STAT_Pos    (29U)
#define USB_ISTR_DCON_STAT_Msk    (0x1UL << USB_ISTR_DCON_STAT_Pos)      /*!< 0x20000000 */
#define USB_ISTR_DCON_STAT        USB_ISTR_DCON_STAT_Msk                 /*!< Device connection status */
#define USB_ISTR_LS_DCON_Pos      (30U)
#define USB_ISTR_LS_DCON_Msk      (0x1UL << USB_ISTR_LS_DCON_Pos)        /*!< 0x40000000 */
#define USB_ISTR_LS_DCON          USB_ISTR_LS_DCON_Msk                   /*!< Low speed device connected */

