MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* *************************************  Bit definition for XSPI_AR register  ************************************** */
#define XSPI_AR_ADDRESS_Pos       (0U)
#define XSPI_AR_ADDRESS_Msk       (0xFFFFFFFFUL << XSPI_AR_ADDRESS_Pos)  /*!< 0xFFFFFFFF */
#define XSPI_AR_ADDRESS           XSPI_AR_ADDRESS_Msk                    /*!< Address */

/* *************************************  Bit definition for XSPI_DR register  ************************************** */
#define XSPI_DR_DATA_Pos          (0U)
#define XSPI_DR_DATA_Msk          (0xFFFFFFFFUL << XSPI_DR_DATA_Pos)     /*!< 0xFFFFFFFF */
#define XSPI_DR_DATA              XSPI_DR_DATA_Msk                       /*!< Data */

/* ************************************  Bit definition for XSPI_PSMKR register  ************************************ */
#define XSPI_PSMKR_MASK_Pos       (0U)
#define XSPI_PSMKR_MASK_Msk       (0xFFFFFFFFUL << XSPI_PSMKR_MASK_Pos)  /*!< 0xFFFFFFFF */
#define XSPI_PSMKR_MASK           XSPI_PSMKR_MASK_Msk                    /*!< Status mask */

/* ************************************  Bit definition for XSPI_PSMAR register  ************************************ */
#define XSPI_PSMAR_MATCH_Pos      (0U)
#define XSPI_PSMAR_MATCH_Msk      (0xFFFFFFFFUL << XSPI_PSMAR_MATCH_Pos) /*!< 0xFFFFFFFF */
#define XSPI_PSMAR_MATCH          XSPI_PSMAR_MATCH_Msk                   /*!< Status match */

/* *************************************  Bit definition for XSPI_PIR register  ************************************* */
#define XSPI_PIR_INTERVAL_Pos     (0U)
#define XSPI_PIR_INTERVAL_Msk     (0xFFFFUL << XSPI_PIR_INTERVAL_Pos)    /*!< 0x0000FFFF */
#define XSPI_PIR_INTERVAL         XSPI_PIR_INTERVAL_Msk                  /*!< Polling interval */

/* *************************************  Bit definition for XSPI_CCR register  ************************************* */
#define XSPI_CCR_IMODE_Pos        (0U)
#define XSPI_CCR_IMODE_Msk        (0x7UL << XSPI_CCR_IMODE_Pos)          /*!< 0x00000007 */
#define XSPI_CCR_IMODE            XSPI_CCR_IMODE_Msk                     /*!< Instruction mode */
#define XSPI_CCR_IMODE_0          (0x1UL << XSPI_CCR_IMODE_Pos)          /*!< 0x00000001 */
#define XSPI_CCR_IMODE_1          (0x2UL << XSPI_CCR_IMODE_Pos)          /*!< 0x00000002 */
#define XSPI_CCR_IMODE_2          (0x4UL << XSPI_CCR_IMODE_Pos)          /*!< 0x00000004 */
#define XSPI_CCR_IDTR_Pos         (3U)
#define XSPI_CCR_IDTR_Msk         (0x1UL << XSPI_CCR_IDTR_Pos)           /*!< 0x00000008 */
#define XSPI_CCR_IDTR             XSPI_CCR_IDTR_Msk                      /*!< Instruction double transfer rate */
#define XSPI_CCR_ISIZE_Pos        (4U)
#define XSPI_CCR_ISIZE_Msk        (0x3UL << XSPI_CCR_ISIZE_Pos)          /*!< 0x00000030 */
#define XSPI_CCR_ISIZE            XSPI_CCR_ISIZE_Msk                     /*!< Instruction size */
#define XSPI_CCR_ISIZE_0          (0x1UL << XSPI_CCR_ISIZE_Pos)          /*!< 0x00000010 */
#define XSPI_CCR_ISIZE_1          (0x2UL << XSPI_CCR_ISIZE_Pos)          /*!< 0x00000020 */
#define XSPI_CCR_ADMODE_Pos       (8U)
#define XSPI_CCR_ADMODE_Msk       (0x7UL << XSPI_CCR_ADMODE_Pos)         /*!< 0x00000700 */
#define XSPI_CCR_ADMODE           XSPI_CCR_ADMODE_Msk                    /*!< Address mode */
#define XSPI_CCR_ADMODE_0         (0x1UL << XSPI_CCR_ADMODE_Pos)         /*!< 0x00000100 */
#define XSPI_CCR_ADMODE_1         (0x2UL << XSPI_CCR_ADMODE_Pos)         /*!< 0x00000200 */
#define XSPI_CCR_ADMODE_2         (0x4UL << XSPI_CCR_ADMODE_Pos)         /*!< 0x00000400 */
#define XSPI_CCR_ADDTR_Pos        (11U)
#define XSPI_CCR_ADDTR_Msk        (0x1UL << XSPI_CCR_ADDTR_Pos)          /*!< 0x00000800 */
#define XSPI_CCR_ADDTR            XSPI_CCR_ADDTR_Msk                     /*!< Address double transfer rate */
#define XSPI_CCR_ADSIZE_Pos       (12U)
#define XSPI_CCR_ADSIZE_Msk       (0x3UL << XSPI_CCR_ADSIZE_Pos)         /*!< 0x00003000 */
#define XSPI_CCR_ADSIZE           XSPI_CCR_ADSIZE_Msk                    /*!< Address size */
#define XSPI_CCR_ADSIZE_0         (0x1UL << XSPI_CCR_ADSIZE_Pos)         /*!< 0x00001000 */
#define XSPI_CCR_ADSIZE_1         (0x2UL << XSPI_CCR_ADSIZE_Pos)         /*!< 0x00002000 */
#define XSPI_CCR_ABMODE_Pos       (16U)
#define XSPI_CCR_ABMODE_Msk       (0x7UL << XSPI_CCR_ABMODE_Pos)         /*!< 0x00070000 */
#define XSPI_CCR_ABMODE           XSPI_CCR_ABMODE_Msk                    /*!< Alternate-byte mode */
#define XSPI_CCR_ABMODE_0         (0x1UL << XSPI_CCR_ABMODE_Pos)         /*!< 0x00010000 */
#define XSPI_CCR_ABMODE_1         (0x2UL << XSPI_CCR_ABMODE_Pos)         /*!< 0x00020000 */
#define XSPI_CCR_ABMODE_2         (0x4UL << XSPI_CCR_ABMODE_Pos)         /*!< 0x00040000 */
#define XSPI_CCR_ABDTR_Pos        (19U)
#define XSPI_CCR_ABDTR_Msk        (0x1UL << XSPI_CCR_ABDTR_Pos)          /*!< 0x00080000 */
#define XSPI_CCR_ABDTR            XSPI_CCR_ABDTR_Msk                     /*!< Alternate- byte double transfer rate */
#define XSPI_CCR_ABSIZE_Pos       (20U)
#define XSPI_CCR_ABSIZE_Msk       (0x3UL << XSPI_CCR_ABSIZE_Pos)         /*!< 0x00300000 */
#define XSPI_CCR_ABSIZE           XSPI_CCR_ABSIZE_Msk                    /*!< Alternate-byte size */
#define XSPI_CCR_ABSIZE_0         (0x1UL << XSPI_CCR_ABSIZE_Pos)         /*!< 0x00100000 */
#define XSPI_CCR_ABSIZE_1         (0x2UL << XSPI_CCR_ABSIZE_Pos)         /*!< 0x00200000 */
#define XSPI_CCR_DMODE_Pos        (24U)
#define XSPI_CCR_DMODE_Msk        (0x7UL << XSPI_CCR_DMODE_Pos)          /*!< 0x07000000 */
#define XSPI_CCR_DMODE            XSPI_CCR_DMODE_Msk                     /*!< Data mode */
#define XSPI_CCR_DMODE_0          (0x1UL << XSPI_CCR_DMODE_Pos)          /*!< 0x01000000 */
#define XSPI_CCR_DMODE_1          (0x2UL << XSPI_CCR_DMODE_Pos)          /*!< 0x02000000 */
#define XSPI_CCR_DMODE_2          (0x4UL << XSPI_CCR_DMODE_Pos)          /*!< 0x04000000 */
#define XSPI_CCR_DDTR_Pos         (27U)
#define XSPI_CCR_DDTR_Msk         (0x1UL << XSPI_CCR_DDTR_Pos)           /*!< 0x08000000 */
#define XSPI_CCR_DDTR             XSPI_CCR_DDTR_Msk                      /*!< Data double transfer rate */
#define XSPI_CCR_DQSE_Pos         (29U)
#define XSPI_CCR_DQSE_Msk         (0x1UL << XSPI_CCR_DQSE_Pos)           /*!< 0x20000000 */
#define XSPI_CCR_DQSE             XSPI_CCR_DQSE_Msk                      /*!< DQS enable */

/* *************************************  Bit definition for XSPI_TCR register  ************************************* */
#define XSPI_TCR_DCYC_Pos         (0U)
#define XSPI_TCR_DCYC_Msk         (0x1FUL << XSPI_TCR_DCYC_Pos)          /*!< 0x0000001F */
#define XSPI_TCR_DCYC             XSPI_TCR_DCYC_Msk                      /*!< Number of dummy cycles */
#define XSPI_TCR_DHQC_Pos         (28U)
#define XSPI_TCR_DHQC_Msk         (0x1UL << XSPI_TCR_DHQC_Pos)           /*!< 0x10000000 */
#define XSPI_TCR_DHQC             XSPI_TCR_DHQC_Msk                      /*!< Delay hold quarter cycle */
#define XSPI_TCR_SSHIFT_Pos       (30U)
#define XSPI_TCR_SSHIFT_Msk       (0x1UL << XSPI_TCR_SSHIFT_Pos)         /*!< 0x40000000 */
#define XSPI_TCR_SSHIFT           XSPI_TCR_SSHIFT_Msk                    /*!< Sample shift */

