MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/* *************************************  Bit definition for XSPI_WIR register  ************************************* */
#define XSPI_WIR_INSTRUCTION_Pos  (0U)
#define XSPI_WIR_INSTRUCTION_Msk  (0xFFFFFFFFUL << XSPI_WIR_INSTRUCTION_Pos)   /*!< 0xFFFFFFFF */
#define XSPI_WIR_INSTRUCTION      XSPI_WIR_INSTRUCTION_Msk                     /*!< Instruction */

/* ************************************  Bit definition for XSPI_WABR register  ************************************* */
#define XSPI_WABR_ALTERNATE_Pos   (0U)
#define XSPI_WABR_ALTERNATE_Msk   (0xFFFFFFFFUL << XSPI_WABR_ALTERNATE_Pos)    /*!< 0xFFFFFFFF */
#define XSPI_WABR_ALTERNATE       XSPI_WABR_ALTERNATE_Msk                      /*!< Alternate bytes */

/* ************************************  Bit definition for XSPI_HLCR register  ************************************* */
#define XSPI_HLCR_LM_Pos          (0U)
#define XSPI_HLCR_LM_Msk          (0x1UL << XSPI_HLCR_LM_Pos)            /*!< 0x00000001 */
#define XSPI_HLCR_LM              XSPI_HLCR_LM_Msk                       /*!< Latency mode */
#define XSPI_HLCR_WZL_Pos         (1U)
#define XSPI_HLCR_WZL_Msk         (0x1UL << XSPI_HLCR_WZL_Pos)           /*!< 0x00000002 */
#define XSPI_HLCR_WZL             XSPI_HLCR_WZL_Msk                      /*!< Write zero latency */
#define XSPI_HLCR_TACC_Pos        (8U)
#define XSPI_HLCR_TACC_Msk        (0xFFUL << XSPI_HLCR_TACC_Pos)         /*!< 0x0000FF00 */
#define XSPI_HLCR_TACC            XSPI_HLCR_TACC_Msk                     /*!< Access time */
#define XSPI_HLCR_TRWR_Pos        (16U)
#define XSPI_HLCR_TRWR_Msk        (0xFFUL << XSPI_HLCR_TRWR_Pos)         /*!< 0x00FF0000 */
#define XSPI_HLCR_TRWR            XSPI_HLCR_TRWR_Msk                     /*!< Read-write minimum recovery time */

/** @addtogroup STM32C5xx_Peripheral_Exported_macros
  * @{
  */


/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == ADC1)    \
                                       || ((INSTANCE) == ADC2) \
                                       || ((INSTANCE) == ADC3))

#define IS_ADC_COMMON_INSTANCE(INSTANCE) (((INSTANCE) == ADC12_COMMON) \
                                          || ((INSTANCE) == ADC3_COMMON))

/* Select the ADC common instance to which belongs the selected ADC instance */
#define ADC_COMMON_INSTANCE(adc_instance) \
  ((((adc_instance) == ADC1) || ((adc_instance) == ADC2)) ? (ADC12_COMMON) : (ADC3_COMMON))

/* Select the ADC multimode instance master corresponding to the selected ADC instance */
#define ADC_MULTI_INSTANCE_MASTER(adc_instance) (((adc_instance) == ADC2) ? (ADC1) : (adc_instance))

/******************************* COMP Instances *******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE) ((INSTANCE) == COMP1)

/****************************** CORDIC Instances ******************************/
#define IS_CORDIC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CORDIC)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* CRS Instances ********************************/
#define IS_CRS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRS)

/*************************************** DAC Instances *******************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DAC1)

/******************************* DELAYBLOCK Instances ********************************/
#define IS_DLYB_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DLYB_XSPI1)

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE) (((INSTANCE) == LPDMA1_CH0)  || \
                                       ((INSTANCE) == LPDMA1_CH1)  || \
                                       ((INSTANCE) == LPDMA1_CH2)  || \
                                       ((INSTANCE) == LPDMA1_CH3)  || \
                                       ((INSTANCE) == LPDMA1_CH4)  || \
                                       ((INSTANCE) == LPDMA1_CH5)  || \
                                       ((INSTANCE) == LPDMA1_CH6)  || \
                                       ((INSTANCE) == LPDMA1_CH7)  || \
                                       ((INSTANCE) == LPDMA2_CH0)  || \
                                       ((INSTANCE) == LPDMA2_CH1)  || \
                                       ((INSTANCE) == LPDMA2_CH2)  || \
                                       ((INSTANCE) == LPDMA2_CH3)  || \
                                       ((INSTANCE) == LPDMA2_CH4)  || \
                                       ((INSTANCE) == LPDMA2_CH5)  || \
                                       ((INSTANCE) == LPDMA2_CH6)  || \
                                       ((INSTANCE) == LPDMA2_CH7))

#define IS_LPDMA1_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA1_CH0)  || \
                                        ((INSTANCE) == LPDMA1_CH1)  || \
                                        ((INSTANCE) == LPDMA1_CH2)  || \
                                        ((INSTANCE) == LPDMA1_CH3)  || \
                                        ((INSTANCE) == LPDMA1_CH4)  || \
                                        ((INSTANCE) == LPDMA1_CH5)  || \
                                        ((INSTANCE) == LPDMA1_CH6)  || \
                                        ((INSTANCE) == LPDMA1_CH7))

#define IS_LPDMA2_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA2_CH0)  || \
                                        ((INSTANCE) == LPDMA2_CH1)  || \
                                        ((INSTANCE) == LPDMA2_CH2)  || \
                                        ((INSTANCE) == LPDMA2_CH3)  || \
                                        ((INSTANCE) == LPDMA2_CH4)  || \
                                        ((INSTANCE) == LPDMA2_CH5)  || \
                                        ((INSTANCE) == LPDMA2_CH6)  || \
                                        ((INSTANCE) == LPDMA2_CH7))

#define IS_DMA_PFREQ_INSTANCE(INSTANCE)   (((INSTANCE) == LPDMA1_CH0)  || \
                                           ((INSTANCE) == LPDMA1_CH7)  || \
                                           ((INSTANCE) == LPDMA2_CH0)  || \
                                           ((INSTANCE) == LPDMA2_CH7))

/******************************* ETH Instances *******************************/
#define IS_ETH_ALL_INSTANCE(INSTANCE) ((INSTANCE) == ETH1)

