MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/Include/stm32c591xx.h
/**************** TIM Instances : supporting 8 bits repetition counter ********/
#define IS_TIM_8B_REPETITION_COUNTER_INSTANCE(INSTANCE)     (((INSTANCE) == TIM15) || \
                                                             ((INSTANCE) == TIM16) || \
                                                             ((INSTANCE) == TIM17))
/****************** TIM Instances : supporting repetition counter *************/
#define IS_TIM_REPETITION_COUNTER_INSTANCE(INSTANCE)   (IS_TIM_16B_REPETITION_COUNTER_INSTANCE(INSTANCE) || \
                                                        IS_TIM_8B_REPETITION_COUNTER_INSTANCE(INSTANCE))

/****************** TIM Instances : supporting ADC triggering through TRGO2 ***/
#define IS_TIM_TRGO2_INSTANCE(INSTANCE)    (((INSTANCE) == TIM1) || \
                                            ((INSTANCE) == TIM8))

/******************* TIM Instances : Timer input XOR function *****************/
#define IS_TIM_XOR_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)  || \
                                            ((INSTANCE) == TIM2)  || \
                                            ((INSTANCE) == TIM3)  || \
                                            ((INSTANCE) == TIM4)  || \
                                            ((INSTANCE) == TIM5)  || \
                                            ((INSTANCE) == TIM8)  || \
                                            ((INSTANCE) == TIM12) || \
                                            ((INSTANCE) == TIM15))

/* *********************************************** TIM APB1 Instances *********************************************** */
#define IS_TIM_APB1_INSTANCE(INSTANCE)      (((INSTANCE) == TIM2)   || \
                                             ((INSTANCE) == TIM3)   || \
                                             ((INSTANCE) == TIM4)   || \
                                             ((INSTANCE) == TIM5)   || \
                                             ((INSTANCE) == TIM6)   || \
                                             ((INSTANCE) == TIM7)   || \
                                             ((INSTANCE) == TIM12))

/* *********************************************** TIM APB2 Instances *********************************************** */
#define IS_TIM_APB2_INSTANCE(INSTANCE)      (((INSTANCE) == TIM1)   || \
                                             ((INSTANCE) == TIM8)   || \
                                             ((INSTANCE) == TIM15)  || \
                                             ((INSTANCE) == TIM16)  || \
                                             ((INSTANCE) == TIM17))

/******************** USART Instances : Synchronous mode **********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                     ((INSTANCE) == USART2)  || \
                                     ((INSTANCE) == USART3)  || \
                                     ((INSTANCE) == USART6))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                    ((INSTANCE) == USART2)  || \
                                    ((INSTANCE) == USART3)  || \
                                    ((INSTANCE) == UART4)   || \
                                    ((INSTANCE) == UART5)   || \
                                    ((INSTANCE) == USART6)  || \
                                    ((INSTANCE) == UART7))

/*********************** UART Instances : FIFO mode ***************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                         ((INSTANCE) == USART2)  || \
                                         ((INSTANCE) == USART3)  || \
                                         ((INSTANCE) == UART4)   || \
                                         ((INSTANCE) == UART5)   || \
                                         ((INSTANCE) == USART6)  || \
                                         ((INSTANCE) == UART7)   || \
                                         ((INSTANCE) == LPUART1))

/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                              ((INSTANCE) == USART2)  || \
                                              ((INSTANCE) == USART3)  || \
                                              ((INSTANCE) == USART6))

/****************** UART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1)  || \
                                                            ((INSTANCE) == USART2)  || \
                                                            ((INSTANCE) == USART3)  || \
                                                            ((INSTANCE) == UART4)   || \
                                                            ((INSTANCE) == UART5)   || \
                                                            ((INSTANCE) == USART6)  || \
                                                            ((INSTANCE) == UART7))

/****************** UART Instances : Driver Enable *****************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE)     (((INSTANCE) == USART1)  || \
                                                      ((INSTANCE) == USART2)  || \
                                                      ((INSTANCE) == USART3)  || \
                                                      ((INSTANCE) == UART4)   || \
                                                      ((INSTANCE) == UART5)   || \
                                                      ((INSTANCE) == USART6)  || \
                                                      ((INSTANCE) == UART7)   || \
                                                      ((INSTANCE) == LPUART1))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1)  || \
                                                 ((INSTANCE) == USART2)  || \
                                                 ((INSTANCE) == USART3)  || \
                                                 ((INSTANCE) == UART4)   || \
                                                 ((INSTANCE) == UART5)   || \
                                                 ((INSTANCE) == USART6)  || \
                                                 ((INSTANCE) == UART7)   || \
                                                 ((INSTANCE) == LPUART1))

